{
  "adsense-responsivo": [
    {
      "message": "Bump, parece que hoje em dia, o termo que você fala, o leva como primeiro. E o Google tem um código responsivo, é verdade?",
      "author": "KaMiNa",
      "date": "2015-12-29T06:34:14"
    },
    {
      "message": "Foi utilizado algum framework para criação deste site?\nObrigado.",
      "author": "Victor Naito",
      "date": "2014-12-24T22:30:04"
    },
    {
      "message": "Trabalhei melhor o schema. Não acredito que vá melhorar a nível de ranqueamento, mas ao menos pode melhorar a conversão.\n \nVou escrever outro artigo (polêmico) hoje pra ver se alavanco uns backlinks também =)",
      "author": "Leandro Oriente",
      "date": "2014-01-13T21:07:30"
    },
    {
      "message": "Quanto a SERP, se estiver logado com conta google, deveria aparecer algo semelhante a isso:",
      "author": "Leandro Oriente",
      "date": "2014-01-13T21:05:28"
    },
    {
      "message": "Cara, te contar que eles criaram sem minha autorização.\n\nPuxaram os dados do Orkut na época e criaram a conta. Alguns amigos passaram por isso tb.\nE pra excluir é um inferno rsrs.\n\n\nVou dar uma futicada aqui, mas vai ser complicado. Estava associada ao meu falecido hotmail =(",
      "author": "Leandro Oriente",
      "date": "2014-01-13T20:52:28"
    },
    {
      "message": "Belo artigo, mas ao pesquisar \"Leandro Oriente\" eu só achei um perfil do Badoo hahahahhahauhdasiuhdiuashdiusad",
      "author": "Matheus Kramer",
      "date": "2014-01-13T20:40:53"
    },
    {
      "message": "Show vou fazer uns testes nele. se chegar a algum resultado diferente publico por aqui.\n\n\nquanto ao resultado testei em aba anônima e como tenho bloqueio no pc, o google não mapeia meus gostos pessoais. mas SEO é isso mesmo uma guerra diária pra manter-se no topo, ainda mais brigando com um gigante desses, mas só de você ser o segundo em uma busca tão genérica como essa, já é um resultado surpreendente.",
      "author": "Mario Ernesto",
      "date": "2014-01-13T20:21:09"
    },
    {
      "message": "Putz, me passou de novo.\n\nMaldito Jimmy Wales pedinte virtual husahsuahsa.\nVou fazer umas ligações e ver o que resolvo aqui.",
      "author": "Leandro Oriente",
      "date": "2014-01-13T14:44:19"
    },
    {
      "message": "Mesmo anônimo a Wikipédia está na frente ainda, mas mesmo assim é um resultado excelente!\n\n\nBTW, ótimo artigo!",
      "author": "Ricardo Arrigoni",
      "date": "2014-01-13T14:31:41"
    },
    {
      "message": "Fica a vontade. Na vdd deixei ele bem mais enxuto para o Post. Faço algumas coisas a mais aqui no blog tb.\n\n\nQuanto ao resultado, pode ser pq o google oferece resultados otimizados por usuário.\nTenta numa aba anônima, talvez eu esteja na frente.",
      "author": "Leandro Oriente",
      "date": "2014-01-13T13:14:20"
    },
    {
      "message": "Eu também não resisti e escrevi \"desenvolvedor front end\" e alguma coisa milagrosa a Wikipedia fez que voltou ao topo. se me permitir posso usar, modificar e testar seu script?",
      "author": "Mario Ernesto",
      "date": "2014-01-13T12:38:17"
    },
    {
      "message": "Se achar algo comento sim.\nJá estava pensando em escrever um sobre SEO para pequenos Blogs onde citaria a integração com o G+.",
      "author": "Leandro Oriente",
      "date": "2014-01-13T12:07:18"
    },
    {
      "message": "Quanto a isso do \"mini profile\", também consegui fazer, achei bem interessante.\n\n\nQuando tiver uma resposta a essa questão de estar logado publicar pra gente ver \\o",
      "author": "Felipe Fialho",
      "date": "2014-01-13T11:48:51"
    },
    {
      "message": "Vlw @disqus_jJngjQKced:disqus  =)\n\nOutro ajuste que fiz relacionado a SERP foi relacionar melhor o meu perfil do Google Plus ao meu site.\n\nAo pesquisar por \"Leandro Oriente\" aparece um mini profile meu.\nSó que ele só aparece se o usuário estiver logado na conta Google. Estou pesquisando ainda o porque, mas me parece alguma restrição do próprio Google.\n\nAbs",
      "author": "Leandro Oriente",
      "date": "2014-01-13T11:46:02"
    },
    {
      "message": "Leandro,\n\nObviamente não resisti e escrevi \"desenvolvedor front end\"... simplesmente assustador, haha. Incrível.\n\nGostei muito do novo visual, que seja um ótimo 2014 para todos \\o",
      "author": "Felipe Fialho",
      "date": "2014-01-13T11:37:29"
    },
    {
      "message": "Artigo realmente interessante. Parabéns. Muitos sites quebram no celular por não oferecer essa solução para seus clientes.",
      "author": "Mateus Avila Isidoro",
      "date": "2014-01-11T04:04:33"
    }
  ],
  "como-aprender-ingles": [
    {
      "message": "A caixinha de assinatura por imail tá com problemas. Confere aí.",
      "author": "Steinnorff Bourustinrher",
      "date": "2016-07-22T15:32:16"
    },
    {
      "message": "Uma dica boa também é estudar a linguagem favorita com livros em Inglês",
      "author": "Alan Albuquerque",
      "date": "2016-06-23T15:45:09"
    },
    {
      "message": "Leandro tens que atualizar mais o blog cara, poh seus posts são muito bons mesmo, conheço o seu blog desde 2013, de tempo em tempo venho aqui ver se tem alguma coisa pra ler. Pena que não tem rolado mais posts. Estou na saga do inglês agora e seguindo muitas das suas dicas, adotei sua principal dica sobre como cobrar um freela, ou seja, não faço mais freelas, e também de  tempo em tempo leio novamente e divulgo o post \"Olá. Meu nome é Leandro e sou um ex-viciado\", que é outro texto fantástico. Vou torcer pra que você se inspire e volte a escrever brother, você ajuda muita gente \"espalhando a palavra\"  ;).",
      "author": "Dimi Antoni Vargas",
      "date": "2016-06-23T14:24:36"
    },
    {
      "message": "Ótimo Post! Para mim, o que tem me ajudado mais é bate papo com os \"gringos\" e podcasts em inglês (mas para isso, você precisa ter um certo conhecimento, senão apenas ouvirá e não vai entender nada).",
      "author": "Wagner Junior",
      "date": "2015-11-27T11:51:17"
    },
    {
      "message": "esse curso de inglês parece ser muito bom http://goo.gl/rl36CE deem um olhada o curriculo do cara e sensacional e promete que você aprenda o ingês em 4 meses",
      "author": "Daniel Alves",
      "date": "2015-06-06T13:53:31"
    },
    {
      "message": "Realmente a busca por um curso de inglês mais viável é o que conseguiria arcar. Porque atualmente não tenho condições de ir para o exterior estudar 6 meses de curso intensivo. Claro que seria a melhor opção mas infelizmente não tenho tantas dilmas assim para sustentar o curso. Estou usando também o duolingo mas somente quando vou dormir porque também não quero parecer um retardado repetindo palavras no meio da rua ou a caminho do trabalho...kkkk\n\nValeu pelas dicas e ótimo post.",
      "author": "Fernando",
      "date": "2015-06-05T19:41:32"
    },
    {
      "message": "Parabéns artigo sensacional.",
      "author": "cmpereira",
      "date": "2015-05-25T12:15:40"
    },
    {
      "message": "Eai\nLeandro, conseguiu? Rs\n\nPrimeiramente parabéns pelo post, me identifiquei muito.\n\nNo meu caso eu entendo praticamente tudo o que leio e compreendo\ntranquilamente artigos e posts em inglês, também compreendo grande parte daquilo que escuto, mas quando o assunto é conversação... Aí é que está o problema.\n\nJá concluí o Duolingo e ele me ajudou muito no que diz respeito à vocabulário, mas não a fala.\n\nEste ano me propus a praticar (de qualquer forma, não\nimporta como) a minha habilidade na fala (vamos ver no que dá). Para isso comecei a pesquisar formas de praticar, eis o que tenho feito: Para ganhar mais vocabulário, tenho lido artigos em inglês, às vezes no NY Times, mas normalmente tenho usado um site chamado lingua.ly , que possui um jeito bem bacana para ajudar no inglês, lá você lê o artigo, e quando encontra uma\npalavra nova basta dar um double click nela que aparece a tradução, inclusive\nem um contexto para exemplificar, a mesma é adicionada ao seu dicionário. O lingua.ly possui uma extensão pro chrome que possibilita que o mesmo feito nele seja feito em qualquer outro site. Existe também um app.\n\nConheci também um site chamado italki.com , no qual você conversa com nativos do idioma gratuitamente, só o que você precisa é ensiná-lo seu idioma. Lá você também pode ter aulas com professores particulares, tudo via Skype. O site só serve para encontrar as pessoas, o chat mesmo é fora.\n\nTambém configurei meu celular para inglês.\n\nEnfim é isso, espero que eu consiga. Rs \n\nE você tbm, e todo mundo que quiser seguir as dicas. Rs",
      "author": "Lucas",
      "date": "2015-05-14T16:46:42"
    },
    {
      "message": "Thanks...mas entrei em ctt com o Jonathan e ele me disse que não poderá atender no meu endereço (moro no Centro - prox Praça Cruz Vermelha)..Vc conhece outro professor para indicar?",
      "author": "Beth ",
      "date": "2015-03-20T19:29:52"
    },
    {
      "message": "Leandro rdo bem? Entrei em contato com o Jonathan e infelizmente ele me informou que não poderá dar aulas no meu endereço ( moro no centro - prox a Cruz vermelha). Você teria alguma outra pessoa para me indicar?",
      "author": "Beth",
      "date": "2015-03-20T19:16:33"
    },
    {
      "message": "Leandro boa tarde. Gostei muito do seu post. Muito útil. Você poderia me passar o ct de seu professor particular? Tb estou procurando, mas é difícil achar um de confiança...Como são as aulas? Ele leva o tema, é estruturado em sequências? Obrigada!",
      "author": "Beth",
      "date": "2015-03-19T15:42:08"
    },
    {
      "message": "Opa, posso sim: http://www.inglesrio.com.br/",
      "author": "Leandro Oriente",
      "date": "2015-03-19T15:35:48"
    },
    {
      "message": "Oi. Boa tarde. Gostei mto de suas dicas. E tb estou procurando um professor particular. Você pode passar o contto do seu? Grata. Beth",
      "author": "Beth",
      "date": "2015-03-19T15:33:13"
    },
    {
      "message": "muito bom o post, quais seriam os podcasts?",
      "author": "Marcelo Brito",
      "date": "2015-03-08T07:19:19"
    },
    {
      "message": "Aprendeu? =D",
      "author": "Gabriel Mendes",
      "date": "2015-02-26T23:28:16"
    },
    {
      "message": "Mt, to fazendo td isso, só não tenho um professor particular ainda, tentei fazer CNA, mas não me adaptei com o metodo.\nQuais seriam os podcasts indicados?",
      "author": "Fernando Guisso",
      "date": "2015-02-26T23:26:10"
    },
    {
      "message": "Boas dicas Leandro, esse carinha me ajudou pra caramba com seus cursos tbem! ele te manda vídeos com aulas por email free, se vc quiser tbem tem uma versão paga no site. http://effortlessenglishclub.com/ sem falar q o cara é uma figura! \nAbs! seu blog é show",
      "author": "Marcelo Lynx",
      "date": "2015-02-09T01:41:27"
    },
    {
      "message": "Show de bola o post. Parabéns e valeu por compartilhar com a gente essas informações.",
      "author": "Vinicius Dacal Lopes",
      "date": "2015-01-26T19:24:07"
    },
    {
      "message": "Leandro, ótimo texto. Também estou estudando inglês por conta própria e por meio do professor particular. Recomendo um site chamando engVip - http://www.engvid.com/\n\nOutra recomendação é esse link do youtube - https://www.youtube.com/watch?v=bB5CZbdesLg \n\nEsse link é para o vídeo número 1, mas existe a continuação. Se não me engano até o número 24.",
      "author": "Rodrigo",
      "date": "2014-07-22T19:27:57"
    },
    {
      "message": "Leandro, tudo certo?\n\nMe identifiquei com o seu post e me encontro numa mesma situação. Estudei por anos em uma escola e fiz alguns meses de aula particular há anos atrás. Toco meu dia-a-dia lendo posts em inglês e assistindo screencasts ou palestras em inglês e me sinto razoavelmente confortável com isso. Só não me sinto confortável quando preciso falar ao vivo com nativos, e isso me incomoda bastante...\n\nTracei uma meta como você, só que fui um pouco mais ousado, hehe! Vamos ver se eu conseguirei seguir adiante... Decidi fazer uma imersão e estou fazendo o seguinte:\n\n* Assinei o Englishtown há uma semana para fazer aulas de gramática, vocabulário, leitura e audição\n\n* Procuro ler notícias de vários assuntos em sites como NYTimes e o The Guardian para ganhar vocabulário (não técnico)\n\n* Baixo podcasts dos sites anteriores para me acostumar com a pronúncia de ambos os países\n\n* Baixei um aplicativo excelente chamado Umano (https://umano.me/) onde você configura os temas de seu interesse (tecnologia, esporte, finanças) e ele te propõe notícias reais narradas de sites conhecidos Forbes, CNN, Gizmodo, Medium, NYTimes, Newsweek entre outros. Você monta sua playlist e pode escutar as notícias em velocidades de seu interesse. Pode utilizar 0.5x se a narração estiver muito rápida e difícil de entender ou acelerar para 2x para treinar no modo hard. Esta aplicação possui um visual bem trabalhado, possui o modo-carro e você pode ler a notícia no aplicativo no caso de querer checar como anda sua compreensão auditiva. Utilizo ele no carro e é uma maneira de treinar minha compreensão auditiva com notícias reais e de sites do meu interesse.\n\n* Assistir filmes e séries com legenda (ainda não consegui ajustar a minha rotina)\n\n* Conversação através de salas de bate-papo da Englishtown (ainda não consegui ajustar a minha rotina)\n\n* Fazer aulas particulares após uns meses para reforçar a parte de gramática (que sou péssimo)\n\nVamos ver como será o meu progresso.\n\nAbraço e bons estudos. ;)",
      "author": "Marcel dos Santos",
      "date": "2014-07-11T23:37:13"
    },
    {
      "message": "O ruim do MMO é que te vicia!! kkkkk",
      "author": "William Oliveira",
      "date": "2014-07-02T17:31:10"
    },
    {
      "message": "Rapaz, essa de setar os aplicativos eu uso a um tempo e posso garantir que é excelente!! :D \nParabéns",
      "author": "William Oliveira",
      "date": "2014-07-02T17:30:54"
    },
    {
      "message": "Namoro ou tenha uma amiga que seja professora de inglês!",
      "author": "Icaro José Bilinski",
      "date": "2014-06-30T09:47:51"
    },
    {
      "message": "Realmente Fernando, aprendi MUITO com jogos. Principalmente MMORPG onde precisava me virar pra conseguir ajuda =)",
      "author": "Leandro Oriente",
      "date": "2014-06-02T14:48:04"
    },
    {
      "message": "Cara, VC esqueceu de citar o modo mais divertido: jogos online.\nSejam MMOs, shooter, qualquer um, contanto que se tenha um contato entre os jogadores...\nDesde criança eu estou exposto a jogos, depois de um tempo comecei com MMOs e dai comecei aaprender. \nObvio, não foi só isso. Na faculdade, a leitura de papers e o fato de os melhores livros serem escritos em inglês me ajudou (obrigou) a aprender.\n\nConcordo contigo, cursos são um saco e querem mais te prender do que qualquer outra coisa. Mas os livros que eles usam são legais pra VC pegar semântica e sintaxe na hora de escrever e falar. \nNetflix também é outra ferramenta bacana. Pq nos filmes e series VC ainda começa a se acostumar com sotaques.",
      "author": "FernandoLl",
      "date": "2014-06-01T23:00:34"
    },
    {
      "message": "Irado!\n\n\nVárias dicas excelentes.",
      "author": "Leandro Oriente",
      "date": "2014-05-12T15:16:04"
    },
    {
      "message": "Lembrei de ti: http://educacao.uol.com.br/album/2014/04/24/veja-10-praticas-para-destravar-o-ingles.htm#fotoNav=1",
      "author": "Enio",
      "date": "2014-05-12T14:42:50"
    },
    {
      "message": "Opa @breno_alvs:disqus . Obrigado pelo feedback!\n\nUm dos pontos mais eficientes da minha jornada de estudo é realmente assistir as séries e filmes. Ajuda demais no vocabulário e na pronunciação.\n\nVlw por ter compartilhado suas experiências também. Nem todo mundo tem essa visão de que existem outras formas de aprender inglês sem necessariamente ser em um curso.",
      "author": "Leandro Oriente",
      "date": "2014-05-02T20:06:27"
    },
    {
      "message": "Não tinha pensado na idéia de podcasts! Muito boa também!\n\nRecentemente tenho me dedicado aos filmes (de variados temas) pelo Netflix.\nNão gosto muito das séries porque normalmente os personagens tem um vocabulário/sotaque específico dependendo do tema da série (o que vicia minha pronúncia). Não que isso não ocorra com os filmes, mas acho que com uma variedade de temas você consegue encontrar as formas mais comuns de pronúncia com mais facilidade.\n\nPor exemplo, há algum tempo parei pra rever alguns episódios de \"um maluco no pedaço\" e acho que é o auge desse ponto que citei. O Will tem um vocabulário todo \"lelek\" e a família com um vocabulário extremamente sofisticado para o dia-a-dia.\n\nEnfim, que legal ver que tem bastante gente da área se esforçando nessa parte da comunicação. Acho que nosso país tem evoluído bem na nossa área, o que não nos deixa ficar muito atrás dos países high-tech. E o inglês tem esse papel importante no acesso à informação.\n\nValeu Leandro!\nObrigado por compartilhar suas experiências.",
      "author": "Breno Alves",
      "date": "2014-05-02T19:34:58"
    },
    {
      "message": "@disqus_vlkSoVCK0s:disqus a meta principal é a experiência internacional mesmo =)",
      "author": "Leandro Oriente",
      "date": "2014-04-29T04:01:45"
    },
    {
      "message": "@Enio vlw pelas dicas de Podcasts.\nJá haviam me recomendado os da BBC. Vou dar uma olhada sim.\n\n\nQuanto ao inglês, já faço aulas com um professor britânico. Ao finalizar pretendo procurar algum país com inglês britânico mesmo =)\n\n\nSegundo ele, as meninas adoram rsrs.",
      "author": "Leandro Oriente",
      "date": "2014-04-29T04:01:12"
    },
    {
      "message": "Com podcasts, tente escutar os do ESL e da BBC (para mim, são ótimos), tem uma sessão deles que é focada exclusivamente para o ensino de línguas. Para o inglês é esta: http://www.bbc.co.uk/worldservice/learningenglish/. Assim que você já estiver mais à vontade, viaje para o Canadá ou até mesmo a Inglaterra, valerá a pena o investimento. América talvez, mas prefiro o bom, simpático e polido inglês britânico.",
      "author": "Enio",
      "date": "2014-04-29T03:05:57"
    },
    {
      "message": "Ia postar só dia 03 Sep 2014 ? É a data que está no post...",
      "author": "Gabriel Oliveira",
      "date": "2014-04-26T00:23:40"
    },
    {
      "message": "Bom post. Citou ótimos complementos para quem aprende inglês de forma convencional e ótimas maneiras de desenvolver o idioma sozinho. \n\nAconselho que não deixe de lado essa experiência internacional que mencionou para concretizar o aprendizado, sempre vai parecer que falta algo se você não tiver essa experiência. É o que ocorre comigo, por falta de tempo e também dinheiro ainda não fiz tal viagem, mas é algo que está nos meus planos para breve.\n\nIsso de setar o idioma dos gadgets para a língua que está aprendendo é quase lei, rs.\n\nVou procurar usar esse Omegle, não conhecia.\n\n\nObrigado por compartilhar sua experiência.\n=}",
      "author": "Gabriel Oliveira",
      "date": "2014-04-26T00:21:36"
    },
    {
      "message": "Essa de legenda em inglês eu vou tentar. \n\nFoda de diminuir o ritmo, é que você se desacostuma MUITO de novo. Eu tava até que ligeiro para pensar e até falar razoavelmente, depois dessa \"quebra\" voltei a me sentir idiota, haha.",
      "author": "Felipe Fialho",
      "date": "2014-04-25T20:09:41"
    },
    {
      "message": "Vlw @disqus_jJngjQKced:disqus \n\n\nTe contar que esse post deveria estar em rascunho ainda. Fui subir uma foto e acabei jogando o post no build tb rsrs.\n\n\nEsses últimos dias eu reduzi o ritmo tb. Porém quero voltar com tudo nas séries e app's.\n\n\nEstou vendo Band of Brothers, The Walking Dead, Game of Thrones e vou começar com The Pacific e House of Cards. \nPosteriormente True Detective e Sherlock.\n\nO lance de ver séries em inglês com legenda em inglês é perfeito porque te ajuda com a pronúncia e com vocabulário novo.\nO Duolingo tem me ajudado com algumas regrinhas. Tem uma galera bem dedicada a ensinar o pessoal nos comentários das perguntas.",
      "author": "Leandro Oriente",
      "date": "2014-04-25T14:06:40"
    },
    {
      "message": "Ótimo post Leandro, sofro do mesmo problema, leio razoavelmente, mas pareço um retardado conversando com alguém com fluência. Estabeleci justamente essa meta ano passado, \"aprender inglês em 1 ano\", estava usando principalmente o Livemocha (ainda era Free) e estava evoluindo bastante.\n\nInfelizmente em determinadas épocas do ano tive períodos bastante movimentado em questão de trabalho e quando chegava em casa perdia a vontade de estudar mais. Depois sai de férias e retrocedeu bastante. Quando tentei voltar o Livemocha ficou pago. Agora conheci o Duolingo.  Espero conseguir concluir essa meta, hehe.",
      "author": "Felipe Fialho",
      "date": "2014-04-25T13:59:54"
    }
  ],
  "como-me-tornar-um-desenvolvedor-front-end": [
    {
      "message": "Muito bacana Leandro seu artigo!\n\nEu dou aulas de programação e os meus alunos dos que eu mais percebo que não gostam de programar o grande problema é o formato de se aprender… Fluxogramas chatos, lógicas que ninguém entende… e por ai vai.\n\nEu escrevi um artigo sobre isso recentemente no meu blog que explica uma receita bem legal para quem Odeia Programar mas precisa programar (que também vale para frontend): http://devsamurai.com.br/eu-odeio-programar-e-agora/\n\nParabéns novamente pelo artigo e espero que a referencia ajude!",
      "author": "Felipe Fontoura",
      "date": "2016-07-26T16:28:51"
    },
    {
      "message": "Faltou indicar uns bons livros, valeu",
      "author": "Jorge",
      "date": "2016-07-06T03:52:33"
    },
    {
      "message": "Podem me indicar um profissional? (preciso para minha página magmatranslation.com)",
      "author": "Nairut Sil",
      "date": "2016-06-29T16:45:48"
    },
    {
      "message": "Resumiu.",
      "author": "Waltenydsam Câmara",
      "date": "2016-03-29T23:43:41"
    },
    {
      "message": "Me desculpe a ignorância, pois sou designer gráfico. Mas qual a diferença entre webdesigner e front end?",
      "author": "Rodrigo Gervenutti",
      "date": "2016-01-05T23:50:39"
    },
    {
      "message": "Boa noite pessoa, uma dúvida. Uma pessoa com conhecimento em algoritmo, conseguiria começar aprendendo javascript ou precisa de uma base em html ou algo do tipo?",
      "author": "Michel Balthazar",
      "date": "2015-12-30T21:40:33"
    },
    {
      "message": "Opa amigo, boa noite.\n\nObrigado pelas críticas. De fato alguns pontos do post não estão escritos da melhor forma possível.\n\nPretendo reescreve-lo em breve junto com boa parte dos demais.\n\nSobre o Mac eu continuo concordando. É uma sugestão particular já que boa parte do ferramental para um desenvolvedor Front-End roda bem no Mac Os. \n\nJá trabalhei com Linux e continuo o usando nos servidores dos meus projetos mas para o dia á dia o Mac Os se comporta melhor.\n\nDe qualquer forma espero que tenha ajudado em algum ponto e agradeço novamente pelo feedback.",
      "author": "Leandro Oriente",
      "date": "2015-11-25T01:54:39"
    },
    {
      "message": "\"Se possível use o Mac.\" - Essa parte foi sério ou foi uma piada? Quase 100% dos servidores e desktop's usam Linux ou Windows. E você recomenda que eles usem um Mac?\n\nAlgumas coisas que você disse podem ser aproveitadas, mas achei sua forma de abordar o tema, as empresas nacionais e as opiniões que não sejam exatamente uma cópia da sua; um tanto quanto grosso, impaciente e incapaz de aceitar opiniões diversas, com um leve tempero de ignorância.\n\nVocê até pode conhecer alguma coisa, mas sua posição elimina sua capacidade de transmitir isso.\n\nAbraços.",
      "author": "systemSki Poziv (sys_c4ll.dll)",
      "date": "2015-11-25T00:07:52"
    },
    {
      "message": "Qual o preconceito com o dreaweaver??? é uma ótima ferramenta !!!",
      "author": "cleison",
      "date": "2015-06-06T01:14:16"
    },
    {
      "message": "Conheça melhor o mundo fascinante de desenvolvimento de aplicativos móveis. \nhttps://pt.yeeply.com/blog/desenvolvimento-de-aplicativos-movel-peritos-vitais/",
      "author": "Evelyn Yeeply",
      "date": "2015-04-30T10:30:12"
    },
    {
      "message": "Vlw @Marcos :) ",
      "author": "Leandro Oriente",
      "date": "2015-04-30T04:15:20"
    },
    {
      "message": "Perfeito!! Tudo em que tinha mais dúvidas foram sanadas com esse post. Parabéns!",
      "author": "Marcos Roberto",
      "date": "2015-04-30T03:55:15"
    },
    {
      "message": "http://leandrooriente.com/guia-de-estudo-front-end/",
      "author": "nat",
      "date": "2015-04-14T06:23:46"
    },
    {
      "message": "Okay, sugeri pelo logo do seu site, obrigado por sanar minha curiosidade.",
      "author": "Edson Anaici",
      "date": "2015-04-07T03:34:35"
    },
    {
      "message": "Não fumo não cara.",
      "author": "Leandro Oriente",
      "date": "2015-04-06T21:03:33"
    },
    {
      "message": "Leandro Oriente, por acaso você fuma Marlboro vermelho ?",
      "author": "Edson Anaici",
      "date": "2015-04-06T20:49:31"
    },
    {
      "message": "Por que não o Dreamweaver???",
      "author": "Jonas",
      "date": "2015-03-03T01:50:43"
    },
    {
      "message": "Leandro, as empresas contratam menores de idade, que conhecem muito bem a linguagem JavaScript? Pra ser exato 16 anos de idade, com HTML  e CSS em um bom nível!",
      "author": "Pedro Neto",
      "date": "2015-02-21T13:33:13"
    },
    {
      "message": "Posso ser programador e design ?\n\nCentralizar no que tem mais haver comigo mas saber do outro também ?\nOu é inconcebível?",
      "author": "Anne",
      "date": "2015-01-25T13:43:40"
    },
    {
      "message": "Bom Post, mas o \"Não use o Dreamweaver\", acho besteira. Sempre usava o notepad e outros programas, mas passei a usar o Dreamweaver recentemente pra ganhar tempo. O Dreamweaver é bom, o problema é a aba de edição fácil(aba design), mas pra usar só a aba de codigos, o Dreamweaver é como qualquer outro e até mais rápido.",
      "author": "Adriano Martins",
      "date": "2014-10-01T23:49:15"
    },
    {
      "message": "Parabéns pelo artigo!\nCitou os principais pontos e foi de muita utilidade para mim.\nMuito bom mesmo!",
      "author": "Bruno Araujo",
      "date": "2014-08-14T23:46:14"
    },
    {
      "message": "Já rolou esse post?",
      "author": "Thiago Lima",
      "date": "2014-08-08T22:18:45"
    },
    {
      "message": "Olá, gostei bastante das suas dicas! Sou um completo e absoluto iniciante nesse assunto, mas fora o que já comentaram, gostaria de saber exatamente em que o linux ou mac pode contribuir? É apenas no sentido de conhecer diferentes formas de trabalhar? Obrigado! :)",
      "author": "Thiago",
      "date": "2014-06-07T18:19:30"
    },
    {
      "message": "\"Acredito que seja um post um pouco inútil para os profissionais que já estão sólidos no mercado\". De maneira nenhuma jovem. Ótimo post. Abraços.",
      "author": "Marcelo Xavier",
      "date": "2014-05-29T14:32:19"
    },
    {
      "message": "Parabéns Leandro, realmente fantástico o post! Estou iniciando nesta área e com certeza suas \"ordens\" serão sim aplicadas! Abraço.",
      "author": "Paulinho Junior",
      "date": "2014-05-29T01:09:24"
    },
    {
      "message": "Parabéns Leandro,\n\nAtualmente ouvimos muito sobre otimização, semântica, boas práticas,... mas sempre muito superficial, com isso fica meio difícil saber se estou no caminho certo ou quebrando a cabeça no lugar errado. Seu post esclareceu muitas dúvidas e chamou atenção para vários pontos indicando onde melhorar. Parabéns pela iniciativa e belo trabalho.",
      "author": "Ramires Gomes",
      "date": "2014-03-06T14:43:49"
    },
    {
      "message": "Não estaria em Nice to have os nossos queridos testes unitários/interface etc..",
      "author": "Lucas Carvalho",
      "date": "2014-01-21T16:53:02"
    },
    {
      "message": "Existe um macete pra conseguir uma conta free, porém, só te da o direito de ter apenas 1 e-mail @seudominio.com\n\nhttp://lifehacker.com/5967336/use-google-app-engine-to-get-google-apps-for-your-domain-for-free",
      "author": "AgtLucas",
      "date": "2013-12-24T16:15:34"
    },
    {
      "message": "Ufa, é tanta coisa para estudar. Mas vamos lá!",
      "author": "Régis Oliveira",
      "date": "2013-12-20T18:25:03"
    },
    {
      "message": "o git foi colocado, não sei se antes ou depois de seu comentario rs",
      "author": "Raul_Souza",
      "date": "2013-11-22T21:57:59"
    },
    {
      "message": "Parabéns pelo post! Estou querendo entrar nessa área de desenvolvimento front-end e esse post me ajudou a descobrir o que eu ainda preciso aprender e onde estudar (no caso do site para estudar Javascript). Obrigado. (:",
      "author": "Raul Craveiro",
      "date": "2013-11-14T10:43:52"
    },
    {
      "message": "Artigo muito interessante. Confira aqui algumas ferramentas para Frontend: http://fredsarmento.me/frontend-tools",
      "author": "Aschz",
      "date": "2013-10-28T12:48:25"
    },
    {
      "message": "Porque não valeria? Tem mercado para todos. \nNem todas as empresas precisam de um app nativo para determinado device. Existem dezenas que precisam apenas de um Web app.\n\nNa grande maioria dos casos um site responsivo pode ser muito mais útil que um App encostado na Play Store ou na Apple Store.\n\nE caso queira cair para apps nativos vale a pena dar uma olhada no PhoneGap e no Titanium",
      "author": "Leandro Oriente",
      "date": "2013-10-17T02:23:12"
    },
    {
      "message": "CSS Reset minimalista rsrs",
      "author": "Leandro Oriente",
      "date": "2013-10-17T02:16:00"
    },
    {
      "message": "* {margin : 0; padding : 0;}",
      "author": "Luis Henrique da Silva",
      "date": "2013-10-16T22:17:29"
    },
    {
      "message": "Leandro, muito bom artigo! Mas fiquei com uma dúvida: agora que estouraram as tecnologias mobile, será que vale a pena se aprofundar em web?",
      "author": "Henrique Souza",
      "date": "2013-10-14T20:11:51"
    },
    {
      "message": "Realmente, o Ubuntu é muito bom mesmo. \n\nPessoal ainda tem medo do Linux, acha que é dificil, mas o Ubuntu é tão fácil quanto o Win, as vezes, até mais fácil, quando um programa está na central de aplicativos, por exemplo, mas o pessoal prefere fica sofrendo com o Windows 8, e perdendo performace durante o dia hehehe.\n\nNo Ubuntu está usando o Sublime Text também?\n\nRealmente se o cara precisar do PS, ai é Mac ou Win mesmo, a Adobe para o Linux só o Adobe Reader e o Editor Brackets e olhe lá. Embora tenha o Wine.",
      "author": "Bruno Aquino",
      "date": "2013-10-14T12:57:56"
    },
    {
      "message": "@brunoaquino:disqus trabalhar com uma Mac é muito bom cara, mas uso Ubuntu na empresa e não deixa a desejar em nada.\n\nTirando o PS que não uso para nada lá, tem praticamente a mesma performance e estabilidade.",
      "author": "Leandro Oriente",
      "date": "2013-10-14T00:41:06"
    },
    {
      "message": "Em breve vou fazer um post exclusivamente para isso.\nFontes de conhecimentos confiáveis.",
      "author": "Leandro Oriente",
      "date": "2013-10-14T00:39:45"
    },
    {
      "message": "Leandro, Parabéns pelo post cara. Está me ajudando muito. Só queria que mencionasse algumas formas de aprendizado. Por estar começando agora, tenho procurado na web instituições ( sérias ) pra cursos como html5 e css3, porém nunca tive experiencias com livros. Se você puder citar alguns livros que vão mais alem de como usar os seletores e tags ( conteudo para iniciantes ) ou alguns sites onde o curso seja mais aplicável.... mas mais uma vez, parabéns!",
      "author": "Ryan Felipe Moraes",
      "date": "2013-10-13T17:53:32"
    },
    {
      "message": "Faltou, \"ter uma máquina da Apple\" kkkkkk =D , parece quase regra! hehehe\nBrincadeira ... \n\nLi o post no Tableless, e vim ler o seu. \nParabéns!\n \nSobre a dica de não ficar 100% no Windows, eu concordo.  \n\nWindows é popular, mas a M$ está acomodada por causa do mercado que adquiriu, seu OS está cada vez pior, em relação aos concorrentes.\n\nSe você for para Linux, não invente moda! vá para o Ubuntu ou algum baseado nele, como Mint e o Elementary OS, mas como eu disse lá no Tablelees, não é pq o outros como o Fedora, OpenSuse e etc sejam difíceis, mas sim pq a comunidade Brasileira do Ubuntu é muito boa, e uma rápida pesquisa no Google e você resolve grande parte dos seus problemas.\n\nE migrando para o Linux, vai ajudar você a usar o terminal.\n\nAbraços!",
      "author": "Bruno Aquino",
      "date": "2013-10-12T12:53:37"
    },
    {
      "message": "Só esqueci de dizer que o post é excelente. Muito bom!",
      "author": "Aécio Neto",
      "date": "2013-10-11T16:31:47"
    },
    {
      "message": "Com certeza @acioneto:disqus. Tudo no seu tempo.\nAté porque boa parte dos itens acima tem dependências claras.\n\nSe não tiver um domínio bom da dependência vai se enrolar todo.",
      "author": "Leandro Oriente",
      "date": "2013-10-11T14:09:33"
    },
    {
      "message": "Vale lembrar que é uma coisa de cada vez, se não o cara (eu) fica(o) maluco hahhahaha",
      "author": "Aécio Neto",
      "date": "2013-10-11T12:32:28"
    },
    {
      "message": "@c81b101b58ffe54364fd2b6e9b0871e0:disqus cara é bom pelo menos pegar uma base.\nMesmo que não seja um expert. \n\n\nJavascript, git e inglês (pelo menos um básico de leitura) são essenciais.",
      "author": "Leandro Oriente",
      "date": "2013-10-09T17:15:45"
    },
    {
      "message": "Postei o link assim prevendo estar bloqueado :p, haha.\n\nObrigado pelos elogios. Não conhecia seu site, estava dando uma lida hoje. Já está entre os favoritos e seguindo no tuiter.\n\nAbraços!",
      "author": "Felipe Fialho",
      "date": "2013-10-09T17:15:36"
    },
    {
      "message": "Vlw @isaaceliape:disqus =)",
      "author": "Leandro Oriente",
      "date": "2013-10-09T17:14:18"
    },
    {
      "message": "Dei uma lida. Inclusive, muito material bacana por lá =).\n\nSe não me engano podia postar o link aqui mesmo. Não lembro de ter bloqueado.\nhttp://www.felipefialho.com/blog/2013/o-que-um-bom-desenvolvedor-front-end-precisa-saber/#.UlVbWNK1zIg",
      "author": "Leandro Oriente",
      "date": "2013-10-09T17:11:20"
    },
    {
      "message": "Acabei de ver lá.\n\n\nUma honra e tanto =D",
      "author": "Leandro Oriente",
      "date": "2013-10-09T17:10:09"
    },
    {
      "message": "Parabéns Leandro! \nReferência no Tableless!.\n\nhttp://tableless.com.br/tornar-dev-front-end/#.UlVffFC39dU",
      "author": "Dione Alves",
      "date": "2013-10-09T13:57:05"
    },
    {
      "message": "Muito bom o post, tá de parabéns!",
      "author": "Isaac Eliape",
      "date": "2013-10-09T13:45:32"
    },
    {
      "message": "Ótimo amigo.\n \nAqui um artigo que escrevi faz um tempinho abordando marromenos a mesma coisa.\n\nw w w . felipefialho . c o m /blog/2013/o-que-um-bom-desenvolvedor-front-end-precisa-saber/#.UlVbWNK1zIg\n\nParabéns pelo site.",
      "author": "Felipe Fialho",
      "date": "2013-10-09T13:35:38"
    },
    {
      "message": "Opa @thulioph:disqus fico feliz que tenha curtido.\n\n\n\nVou ver se tomo fôlego e solto mais alguns posts esse mês =)",
      "author": "Leandro Oriente",
      "date": "2013-09-27T23:43:53"
    },
    {
      "message": "\"O cliente vai olhar pro layout que o Designer mandou e vai querer que aquele JPEG tome vida. Aliás a empresa inteira vai querer e cabe a você fazer isso.\" Só isso já tem grande importância, é você dar vida pra parada, fielmente!\n\n\n\nParabéns pelo post, sou novo na área e sempre gosto de ler esse tipo de conteúdo, é uma injeção de estiga e ânimo pra pessoa ;)",
      "author": "Thulio Philipe",
      "date": "2013-09-27T23:40:08"
    },
    {
      "message": "Também é possível configurar o outlook.com (versão online do outlook) que está com uma interface muito boa gratuitamente com até 300 contas de emai, eu uso e recomendo como uma opção ao google apps.\nSegue um link que ensina a configurar:\nhttp://goo.gl/GOCBES",
      "author": "Isaac Eliape",
      "date": "2013-09-24T18:41:09"
    },
    {
      "message": "Perfeito, obrigado!",
      "author": "Frederico Wuerges Becker",
      "date": "2013-09-13T18:54:25"
    },
    {
      "message": "@nathliaxavier:disqus saiu o RSS http://leandrooriente.com/feed.xml =)",
      "author": "Leandro Oriente",
      "date": "2013-09-13T17:46:56"
    },
    {
      "message": "http://leandrooriente.com/feed.xml",
      "author": "Leandro Oriente",
      "date": "2013-09-13T17:42:29"
    },
    {
      "message": "@fredericowuergesbecker:disqus, @28c25857cbae5e45e5e2956debb0ed00:disqus e @nathliaxavier:disqus o RSS saiu.",
      "author": "Leandro Oriente",
      "date": "2013-09-13T17:42:19"
    },
    {
      "message": "DreamWeaver é EXCELENTE!\nA galera odeia por que é pago.",
      "author": "Bill Rocha",
      "date": "2013-09-11T12:26:49"
    },
    {
      "message": "Artigo fantástico, parabéns !\nMas cadê o botão +1 do Google+ no final do seus posts ? Coloca ai pra gente dar +1 e compartilhar por la também.",
      "author": "Raphael Agneli",
      "date": "2013-09-11T03:08:17"
    },
    {
      "message": "??? tá loco, quer dizer que ter um dominio e dominar isso, é pior que ser pião do google, msn, yahoo???",
      "author": "wouerner brandão",
      "date": "2013-09-11T00:50:07"
    },
    {
      "message": "uau o.o \nachei sensacional o post *.*\nto estudando pra entrar nessa area\nmais tenho de confessar que me criou uma dúvida mto grande em mim u.u\n\n\nassim ... hehe \neu sei : \n  Ps, Ai, HTML, CSS, Jquery (domino)\n  SEO, Wordpress (básico)\n  PHP (quase copiando código praticamente)\n  javascript, git, ingles ( = 0)\n  jsom, dom (nem sei o que é isso)\n\n\nserá que eu consigo arrumar um trampo assim galera???? vlw",
      "author": "fabio",
      "date": "2013-09-10T22:25:19"
    },
    {
      "message": "Só pelo custo da licença já acho que não vale a pena...",
      "author": "Pedro Vidal",
      "date": "2013-09-10T21:28:03"
    },
    {
      "message": "Próximo item do backlog :-) \nSe não tivesse recém operado do olho faria agora. ",
      "author": "Leandro Oriente",
      "date": "2013-09-10T20:20:37"
    },
    {
      "message": "Muito bom o post. To na turma que tá pedindo RSS ;)",
      "author": "Nathália Xavier",
      "date": "2013-09-10T20:13:36"
    },
    {
      "message": "Vc pode usar o Google Apps para ter um Gmail configurado como email do seu domínio. \nAté pouco tempo era gratuito. Hoje em dia é pago mas não é uma fortuna não. ",
      "author": "Leandro Oriente",
      "date": "2013-09-10T20:09:22"
    },
    {
      "message": "Em breve. Próximo item do backlog. :-) ",
      "author": "Leandro Oriente",
      "date": "2013-09-10T20:06:56"
    },
    {
      "message": "Nunca gostei de usar o email do meu domínio. :)",
      "author": "Guilherme Pontes",
      "date": "2013-09-10T20:05:15"
    },
    {
      "message": "Agiliza esse RSS pra gente, Leandro! Hahaha",
      "author": "Weslley Henrique",
      "date": "2013-09-10T19:57:34"
    },
    {
      "message": "Pq é ruim (minha opinião) :D\n(Uso o Sublime Text 3)",
      "author": "Felipe Dumont",
      "date": "2013-09-10T19:41:11"
    },
    {
      "message": "Melhor que o @msn.com é usar @seudominio.com :D",
      "author": "Felipe Dumont",
      "date": "2013-09-10T19:40:25"
    },
    {
      "message": "Sacanagem é o \"Código Secreto\", auahauhau! Não terminei de ler ainda... Tive que comentar...",
      "author": "Marcos Paulo",
      "date": "2013-09-10T19:34:55"
    },
    {
      "message": "por que a critica ao Dreamweaver? kkk",
      "author": "Madson Gr",
      "date": "2013-09-10T18:42:43"
    },
    {
      "message": "Leandro, gostei do conteúdo do site, seus textos são bem interessantes.\nUma pena você não ter RSS disponível, assim ficaria mais fácil de acompanhar as novidades!",
      "author": "Frederico Wuerges Becker",
      "date": "2013-09-09T20:10:29"
    },
    {
      "message": "Eu uso @msn.com pode? hahahahah :(\nNão consegui registrar um nome decente no @gmail.com. \n\n\n\n:P",
      "author": "Guilherme Pontes",
      "date": "2013-09-05T11:39:49"
    },
    {
      "message": "Perfeito post cara, salvando já o site em favoritos para passar acompanhar semanalmente, estou começando por agora, essas dicas já mudou bastante meu pensamento. Abraços",
      "author": "Anderson Menezes",
      "date": "2013-08-28T18:03:58"
    },
    {
      "message": "Ótimo post!",
      "author": "Gustavo Ferreira",
      "date": "2013-08-22T16:43:01"
    },
    {
      "message": "Muito bom, parabéns pelo post! Abraço",
      "author": "Alberto",
      "date": "2013-08-22T16:35:16"
    },
    {
      "message": "Faltou citar o Github! Saber como funciona e usar o git é fundamental, principalmente em uma comunidade tão ativa como a de front end.",
      "author": "brenocalazans",
      "date": "2013-08-22T16:32:48"
    },
    {
      "message": "Muito bom !",
      "author": "Victor Kurauchi",
      "date": "2013-08-22T15:59:52"
    },
    {
      "message": "O DW se bem utilizado é um excelente editor. \n\nO problema maior é que ele oferece ferramentas que quase sempre são mal usadas. \n\nIsso acabou gerando essa má fama ",
      "author": "Leandro Oriente",
      "date": "2013-08-22T14:18:42"
    },
    {
      "message": "Muito bom o Post! Só acho que excluir totalmente o Dreamweaver não acho correto. Tem vários editores de códigos hoje em dia e tal (Sublime, notepad ++ ...), mas deixar de usar o Dreamweaver sei lá acho que depende do gosto do desenvolvedor.",
      "author": "Gustavo Vargas",
      "date": "2013-08-22T14:13:19"
    },
    {
      "message": "Muito bom Leandro!",
      "author": "Edmo Jeova",
      "date": "2013-08-22T13:52:10"
    },
    {
      "message": "Percebi que também sou! Não consigo me fazer entender nada disso, nada... =(",
      "author": "Roberto",
      "date": "2013-08-22T13:15:43"
    },
    {
      "message": "O primeiro impacto que tive ao ler esse post é isso, quando você acha que está caminhando para um nível mais intermediário, alguém lhe mostra a realidade.\nMas, a melhor maneira, é usar isso como um caminho para se tornar um \"BOM\" desenvolvedor.",
      "author": "Matheus",
      "date": "2013-08-22T12:23:13"
    },
    {
      "message": "ótimo post.",
      "author": "Jorge Roberto",
      "date": "2013-08-22T11:29:03"
    },
    {
      "message": "Ótimo post! A dica do currículo em PDF é ótima e é incrível que a galera ainda não tenha percebido isso. Sabe o que mais botar aí? Não usar @hotmail :P hahaha",
      "author": "beeblebrox3",
      "date": "2013-08-22T10:12:13"
    },
    {
      "message": "Volte já aqui goo.gl/afGQJj",
      "author": "Vandhuy Martins",
      "date": "2013-08-22T08:10:49"
    },
    {
      "message": "otimo post!",
      "author": "letanure",
      "date": "2013-08-22T06:27:10"
    },
    {
      "message": "Que isso @7e8ec524adc2c8e6391ef05d414fd561:disqus. \nÉ tudo uma questão de amadurecimento constante.\n\nQuanto mais você estuda, mais você percebe o quão longe está do nível ideal.\nO grande diferencial é manter esse looping infinito =)",
      "author": "Leandro Oriente",
      "date": "2013-08-22T06:20:53"
    },
    {
      "message": "Cara, sou um cocô.",
      "author": "Matheus",
      "date": "2013-08-22T06:16:59"
    }
  ],
  "faculdade-de-informatica-fazer-ou-nao-fazer": [
    {
      "message": "Sou realmente muito grato pela sua visão sobre o mercado de Ti. E quando eu vi o tamanho do texto quase pensei em não começar a ler(Que bom que eu parei para ler)... Eu estava muito desanimado para voltar a estudar informática (tenho 17 anos e concluo o 3°  do ensino médio esse ano ) e eu estava totalmente perdido sobre o que eu iria fazer da minha vida e agora vejo que realmente é na área de programação que eu vou atuar... Sou péssimo em matemática mas como você mesmo disse é necessário o ter conhecimento do mesmo para melhor dominar a área desejada e agora pretendo em breve estar tendo aulas com o professor particular... em fim, só quero lhe agradecer por compartilhar suas experiências que me foram muito úteis...",
      "author": "Vinicius Souza",
      "date": "2016-05-04T12:17:56"
    },
    {
      "message": "Oi. Sem querer me intrometer e ja entrando no papo... eu acho que vc Leandro Oriente esta muito mais focado em dinheiro, eu ñ sou nenhum especialista em TI, sou apenas um fanático pela área e no próximo ano entrarei na Engenharia Informática.\nEu acho que vc deve fazer as coisas por amar, não porque seu salário é o mesmo de um formado, você pensa que vai adquirir mais conhecimento em vão porque o salário é o mesmo, se você quiser aprender e se empenhar o salário não é nada, vc pode até se destacar e receber muito melhor.\n\nPare um pouco de pensar que seu tempo é dinheiro, que sua profissão esta condicionada pelo dinheiro, você pode ser melhor e ganhar muito melhor, mas para isso pare um pouco de pensar em dinheiro apenas.\n\n\nPAULO AMOSSE CUAMBE, Directo de Moçambique",
      "author": "Paulo Amosse",
      "date": "2016-04-27T17:51:16"
    },
    {
      "message": "Olá, você poderia citar quais os critérios mais importantes da seleção? por quais meios o profissional pode ser reconhecido?.",
      "author": "Leonardo da Luz",
      "date": "2015-12-29T02:56:58"
    },
    {
      "message": "Erik, lendo uma da suas respostas dadas ao Leandro, onde você diz, mais ou menos, que um tecnologo aprende Java e .NET, no minimo, em um tecnologo. Discordo completamente. O conteúdo dado no curso tecnologo que fiz, é muito básico. Hoje eu trabalho com automação de testes utilizando Java + selenium ou Ruby. Esta minha atividade, basicamente, é voltada a programação, não utilizo IDE's de automação de testes devido a complexidade no projeto que atuo.\n\nMinhas habilidades foram desenvolvidas através de muita prática, fóruns e pesquisas no google, a universidade insistia em reinventar a roda a cada tópico de matéria. Claro que cumpri com o meu dever de estudante e passei na matéria.\nMas foi graças aos fóruns e programadores que me ajudaram com suas respectivas experiencias(serio, eles são MUITO atenciosos, MUITO, mas MUITO melhores que qualquer professor que já tive nesta área) que hoje, comando uma pequena equipe de automação de testes.\n\nOu seja, enquanto a galera estava criando combobox no segundo semestre, eu já fazia minhas automações em casa, criava progamas simples para analisar o funcionamento de \"N\" técnicas de programação, e hoje o que me atrapalha a fazer tudo isto, é a propria faculdade.\n\nO que o Leandro quis dizer, ao menos foi o que entendi, é que a universidade lhe ensinará 0,03% do básico. Pula-se de matéria em matéria, ve-se muito pouco de cada uma, e no final de tudo, é exigido que vc monte todo o quebra cabeças (assim como vc mesmo disse, que somente no final de seu curso vc vislumbrou a importância de algo que lhe poderia ser útil).\n\nUtilizamos a lógica o tempo todo certo? Em uma discussão destas, a lógica é mais do que importante. \n\nÉ lógico aprender a utilizar um vetor em java em um semestre e no outro como os circuitos de um chuveiro funcionam?\n\nÉ lógico cursar 5 anos e ter de aprender a \"trabalhar\" depois de tudo isso?\n\nÉ lógico cursar 5 anos de materias desatualizadas? \n\nÉ lógico cursar 5 anos só pra saber o que você quer da sua vida?\n\nEu cai nessa mas foi em outra área, contabilidade. Estudei 4 anos e, sinceramente, 2 destes 4 foram uteis de fato.\n\nNosso ensino ainda é baseado no Status. Acreditam que uma pós graduação prepara o profissional para alguma coisa, bem, tenho 30 anos e somente 2 anos nesta área (ti). Hoje comando dois parceiros aqui no trabalho. Um é engenheiro de software o outro, também. Ambos com seus 5 anos de materias incansáveis que, na realidade, jamais passarão do basico, a nao ser que se interessem e busquem cursos especializados(logo, a universidade perde alogica aqui, na minha opiniao).\n\nAgora, fragmentar um curso conforme a idéia do Leandro, seria o mundo perfeito. Eu, pode ter certeza disto, teria economizado MUITO dinheiro se esta fosse nossa realidade e meu salário seria melhor, pois o tempo que perdi descobrindo como um chuveiro funciona (entre tantas outras inutilidades que nos ensinaram), eu teria me dedicado mais a programação e a automação de testes tambem.\n\nO problema é que o Brasil ainda pensa como nossos avós. A necessidade de se mudar o método de ensino é gritante. Quatro anos estudando? Justo, para quem quer ser um professor, tutor e etc ( eu adoraria ser professor, mas me recuso a apssar de 4 a 7 anos para isto), apra engressar no mercado de trabalho? Completamente inútil, ainda mais na nossa área que exige conhecimento antes do título.",
      "author": "Rick gc",
      "date": "2015-11-17T20:01:32"
    },
    {
      "message": "Parabéns pelo seu texto, me ajudou MUITO, eu tenho 14 anos e penso em trabalhar na área  de informática, se texto esclareceu muitas dúvida sobre o assunto. Vou fazer Ensino Médio técnico em Informática, porém vou precisar \"repetir\" o primeiro ano, estou em dúvida se vale a pena ou não.",
      "author": "Mariana de Fatima",
      "date": "2015-04-26T15:37:44"
    },
    {
      "message": "Opa Julio Antonio do Amaral, boa tarde.\n\nBem bacana seu comentário e naturalmente não tenho o que discordar dele. \nExistem diversas áreas na informática e cada uma requer um conjunto específico de conhecimentos para que sejam executadas. A faculdade de forma geral (CComp e Engenharia da Computação) busca dar uma base sólida para todas elas.\n\nEsse post foi escrito em 2013 e de lá para cá amadureci bastante a ideia de fazer uma faculdade. Inclusive vou ingressar agora no meio do ano em uma.\n\nO ponto que tentei expor de forma um pouco imatura, mas que continuo concordando ainda hoje é que as faculdades tentam tocar em 'n' pontos e acabam não aprofundando nenhum. \n\nEssa abrangência tem pontos bons e pontos ruins. Existem alunos que acabam descobrindo interesse por áreas que nunca conheceriam fora da faculdade, o que é bacana. Porém existem alguns que sabem em que área querem trabalhar e muitas vezes até atuam nessa área e acabam tendo que passar 50% do curso vendo matérias que pouco vão acrescentar no nicho de seu interesse.\n\nAlém disso tentar atacar tantos pontos pode dar uma formação tão generalista que no final das contas não atende a nenhum mercado.\n\nEm breve pretendo reescrever esse post e com certeza levarei em consideração o seu comentário.\n\nOBS: Não precisa usar de sua \"autoridade\" para ser ouvido. Leio e respeito a opinião de todos independente do currículo :)",
      "author": "Leandro Oriente",
      "date": "2015-03-09T21:14:42"
    },
    {
      "message": "Olá Leandro Oriente, Boa Tarde! Leandro, esta dúvida assombra a maioria dos ingressantes em cursos de computação, sobretudo nos mais teóricos e em boas Universidades, como Ciência da Computação. Bem, sou pesquisador e Professor Universitário desde 2002 e posso lhe dizer que sua linha de argumentação não está bem fundamentada e correta. Explico porque. Basta você olhar os currículos dos cursos de Ciência da Computação em Universidades como MIT, Stanford, Yale, UFRJ, ITA, USP, etc que vai perceber que a base teórica é matemática e sabe o por quê? Porque um algoritmo meu caro nada mais é do que um modelo matemático para um problema, uma da infinitas soluções, isto é quando o problema é computável. Se parar para pensar, Computação Gráfica depende, no mínimo de Álgebra Linear, Inteligência Artificial no mínimo de Processos Estocásticos, Estatística, Arquitetura de Computadores, claro da Eletrônica, e esta da Física, que por sua vez não consegue se manter se a Matemática... Business Intelligence meu caro, depende de modelos matemáticos. A Mineração de Dados (exceto para aqueles que acham que as rotinas nascem em buracos negros em galáxias distantes) necessita de fortes modelos matemáticos para identificação e correlação de padrões. Visão Artificial usada em Robôs atuais (Carros que Navegam Autonomamente, por exemplo) é um outro exemplo do uso constante de modelos matemáticos. Você sabia que uma Rede Neural que talvez já tenha usado em alguma ferramenta computacional, na verdade é um modelo matemático de uma Rede Neuronal Natural? Bem, acredito que você realmente tenha uma visão muito distorcida do que seja Computação. Computação meu caro não se resume à elaboração de procedimentos, na maioria das vezes, sem qualidade que ocupam grandes quantidades de memória e levam tempos infinitos (no sentido real da palavra) para fornecerem respostas, nem sempre certas. Ah, a propósito, é possível Analisar a Complexidade Temporal e Espacial de um Algoritmo, mas para isso é necessário MATEMÁTICA. Dê uma olhada no livro MATEMÁTICA CONCRETA do Donald Knuth, um simples Professor de Stanford, que você entenderá o que quero dizer. Abraços, Julio (Bacharel em Ciência da Computação e Mestre em Engenharia Eletrônica e Computação pelo ITA, atualmente desenvolvendo Projeto de Doutorado em Engenharia Mecânica Aeronáutica na área de Robótica Aeroespacial no ITA!)",
      "author": "Julio Antonio do Amaral ",
      "date": "2015-03-09T19:36:58"
    },
    {
      "message": "Eu queria saber se uma pessoa sem conhecimento muito alem do basico na area tem que fazer um curso tecnico antes de entrar na Faculdade de TI ou la eles ensinam tudo desde o principio?",
      "author": "Luan",
      "date": "2015-03-04T12:33:49"
    },
    {
      "message": "Seu artigo é ótimo e vem num bom momento pra mim. Estou com 25 anos e nunca tive um grande interesse em fazer faculdade. Atualmente estou cursando técnico em informática no Senac.\n\n\nNossos professores sempre falam para os alunos entrarem para a faculdade, após o término do curso. A partir daí comecei a me questionar sobre fazer ou não.\n\n\nUm colega de turma, chegou a começar uma faculdade, mas também a trancou, só que no quarto período. Também por conta da matemática. Sempre ouvi falar a respeito das matérias de cálculos e fiquei um pouco preocupado de entrar pra faculdade e trancar por esse mesmo motivo.\n\n\nDe uns tempos pra cá, comecei a perceber que tinha interesse em assuntos relacionados a marketing. Daí a dúvida voltou, principalmente porque é outra área. Me alertaram que seria incoerente por isso, mas como meu interesse é principalmente com marketing digital, acredito que se interligam, certo?\n\n\nDe todo modo, minha intenção nesse momento é me preparar com TI. Decidi que vou me dedicar mais em desenvolvimento front end, porque sempre gostei. Quero entrar para o mercado de trabalho e depois decidir se entro ou não para faculdade.\n\n\nAbraço!",
      "author": "Márcio Lima",
      "date": "2015-02-21T17:51:33"
    },
    {
      "message": "Poxa, eu estava lendo um post seu muito interessante, aí você escreveu: \"Aperte CRTL+W\" e eu fiz, agora vim parar aqui e cade a página que eu estava lendo? kkkkkk   Ainda bem que existe o histórico. =)\n\n\nExcelente site! Está nos meus favoritos, com certeza! o/",
      "author": "Bába Paes",
      "date": "2015-02-19T18:20:16"
    },
    {
      "message": "Tem um detalhe muito importante. A classe dos formados em computação não é unida, pouco conhecimento tem de legislação e pouco faz para alterar esse cenário. O resultado dessa negligência é negativo para aqueles que aturaram e aturam os longos anos de graduação. \n\nPor quê? O empresário nessas condições tem um poder muito grande de negociação. Qualquer pessoa pode desenvolver um programa, receber as honras e lançar no mercado. Isso não acontece com projetos que exigem um engenheiro, com cirurgias médicas, por exemplo.  \n\nVou facilitar ainda mais, você tem mais informação e prática em medicina do que um próprio médico, mas este pode efetuar a cirurgia, mesmo não sendo capaz na prática, você não pode. A lei não o permite. \n\nA classe médica existe, é mafiosa e defende-se com unhas e dentes. A classe dos advogados e dos engenheiros também. Cadê a dos matemáticos que se comunicam com computadores?",
      "author": "Taylan Branco Meurer",
      "date": "2015-02-17T01:16:56"
    },
    {
      "message": "Sem sombras de dúvida. O que importa é fazer, produzir, retornar conforme as exigências do espaço, local ou empregador. O titulado leva vantagem quando não precisa comprovar na seleção algum retorno de produção. \n\nNós fomos condicionados a um ensino presencial, a agirmos somente após determinações de um guia, mestre, guru, líder. Em regra, não somos disciplinados para produzir ou obter por conta própria. Por essa razão, supomos que o titulado leva vantagem sobre o não titulado. Sabemos que isso é uma conjectura equivocada.",
      "author": "Taylan Branco Meurer",
      "date": "2015-02-17T01:07:20"
    },
    {
      "message": "Pelo que entendi, você se refere a um curso voltado para o mercado de trabalho, mais curto e específico. Essa é a finalidade do curso tecnológico. \n\nO Bacharelado tem uma finalidade praticamente contrária, longo e generalista. \n\nDarei minha concepção do mercado. O empresário deseja alguém que resolva problemas, o maior número deles se possível. Tornar-se habilidoso apenas em front-end  pode ocasionar desvantagens.",
      "author": "Taylan Branco Meurer",
      "date": "2015-02-17T00:55:29"
    },
    {
      "message": "Cara simplesmente adorei o seu texto, muito bom. Faço ciência da computação e vejo que as faculdades deixam muito a desejar pq o ensino é \"fantasioso\" longe das expectativas do mercado atual, mostram um mercado fácil pra os alunos que nunca colocaram mão na massa.Vou me formar tbm no curso de como se tornar um auditada rsrsrs, na verdade já sou uma. Parabéns pelo texto!",
      "author": "Amanda Santos",
      "date": "2015-02-04T21:14:42"
    },
    {
      "message": "Boa noite amigos, quero dizer que fui bastante feliz em chegar até aqui essa noite e ter a oportunidade de ler cada comentário. \n\nQueria dizer ao garoto de 17 anos e ao rapaz de 22 que estão \"sem tempo\" para a escolha certa do curso que tenho 31 anos e estou bastante empolgado para o início da Faculdade de Ciências da Computação que iniciarei no próximo semestre.\n\n\nNão desistam, vocês são jovens e sempre há tempo, acreditem! Sou de uma geração aonde o tempo passava mais devagar, aos 17 anos de idade eu estava preocupado em outras coisas, achava que tinha todo tempo do mundo. Hoje um garoto de 17 está preocupado com as provações da vida, com a opinião da sociedade e da família, as coisas estão mais dinâmicas e a tecnologia tem contribuído pra essa mudança de comportamento.\n\nAcreditem, vocês podem! Não tenham medo.\n\nParabéns a todos pela contribuição maravilhosa e para o autor desse maravilhoso texto. Boa sorte a todos e um feliz 2015.",
      "author": "Vítor Nativu",
      "date": "2015-01-07T01:14:44"
    },
    {
      "message": "Opa @caioviski:disqus.\n\nNão fique com medo de migrar não cara. \nConheço um excelente profissional na área que fez direito também e que hoje está em Boston trabalhando em uma das empresas mais iradas da área.\n\nVocê ainda é bem jovem e tem muito tempo para se adequar ao mercado. Recomendo que estude em paralelo por conta própria conforme for avançando na faculdade. Estamos numa área muito dinâmica e nem sempre as Faculdades conseguem acompanhar o mercado.\n\n\n\nEstou com 22 também e volto para faculdade semestre que vem :)\nSó que dessa vez para Análise e Desenvolvimento de Sistemas.",
      "author": "Leandro Oriente",
      "date": "2014-11-11T16:44:23"
    },
    {
      "message": "Ótimo texto. Leandro Oriente, estou preste a tomar uma decisão na minha vida, estou terminando a graduação em Direito e pretendo ingressar numa graduação em  Engenharia de Computação, tenho alguns cursos tecnicos de informática que fiz durante a minha adolescência mas nunca cheguei atuar, trabalhando e etc. Hoje tenho 22 anos, e tenho muito medo em não conseguir me aptar ao Mercado, então tá sendo uma decisão muito difícil na minha vida, to lendo diversos textos pela internet e esse foi o mais interessante até o momento. Se puder me ajudar com umas dicas na área de Engenharia de Computação ficarei muito grato. Fico muito preocupado em ter descoberto, tarde, que a minha vocação não é na área do Direito :/   \n\nAbraço",
      "author": "Caio Viski",
      "date": "2014-11-11T16:36:00"
    },
    {
      "message": "Você pretende obter um empréstimo? ou precisa de um empréstimo para iniciar um negócio, e se assim for, por favor contacte-nos em: jeffersoncarsonloanfirm@hotmail.com\n\nnome:\nMontante do empréstimo necessário:\nestado:",
      "author": "Adems Ayez",
      "date": "2014-09-21T02:26:52"
    },
    {
      "message": "Olá @MaybeSick. \n\nAcredito que o uso foi correto. Resolvi pesquisar a respeito e achei esse artigo: http://duvidas.dicio.com.br/enfim-ou-em-fim/\n\n\"A palavra enfim é um advérbio de tempo e significa, principalmente, finalmente e por fim. \"",
      "author": "Leandro Oriente",
      "date": "2014-09-15T18:15:46"
    },
    {
      "message": "Esse \"ENFIM\" no final tirou toda a credibilidade do autor! kkkkkk",
      "author": "MaybeSick",
      "date": "2014-09-15T18:11:45"
    },
    {
      "message": "@disqus_VLi0uCbbRE:disqus tem sim.\n\nA UFRJ tem Ciência da Computação e Engenharia da Computação.\nAqui tem a lista completa https://siga.ufrj.br/sira/repositorio-curriculo/ListaCursos.html.\n\nTenho dois conhecidos que estudaram lá e um que já se formou, e todos elogiaram muito o curso.",
      "author": "Leandro Oriente",
      "date": "2014-08-25T17:17:28"
    },
    {
      "message": "Existe \"faculdade de informática\" na UFRJ também? é boa? sou novo no assunto e não sei muito. Estou na dúvida sobre qual profissão seguir, mas informática parece-me interessante.",
      "author": "Guilherme Costa",
      "date": "2014-08-25T08:09:41"
    },
    {
      "message": "Primeiramente, adorei seu texto. Era exatamente minha duvida. Eu sempre fui muito ligada a área de informatica e inicialmente decidi fazer desenho industrial, porque queria focar na área de web design, mas com o tempo resolvi mudar de ideia  fazer ciência da computação. Pesquisei bem sobre e vi que tinha muita matemática e como minha nota de corte no ENEM não deu pra Ciência da Computação, então entrei em matemática, para depois pedir transferência. Minha ideia de continuar na área de Web Design continua, confesso que tenho um carinho especial pelo photoshop, mas mais ainda pelo html e css. Já mexo com códigos porque monto paginas e designer de fóruns por diversão. coisas que eu aprendi sozinha, apesar de ter feito um curso de Web Design que me ensinou quase nada. Só que estou confusa se vale apena eu mudar minha faculdade e ir fazer ciência da computação, apesar de ser a área que gosto, parece ser uma área bastante complicada de ser manter estável. E também gostaria saber se vale apena hoje em dia trabalhar na área de Web.",
      "author": "Mariana Senne",
      "date": "2014-06-26T19:31:16"
    },
    {
      "message": "Vlw mesmo Leandro,nem é que eu queira fugir da matemática,mas escolher um em que ela não se apresente tanto sabe rsrs,mas novamente muito obrigado pela resposta,me ajudou muito rs,já escolhi agora,espero um dia ser tão fera nisso quanto você hahahaha abração!!!!Bruno",
      "author": "Bruno Lemos",
      "date": "2014-06-02T23:31:21"
    },
    {
      "message": "Opa @matheus_kramer:disqus, perdão pela demora.\n\n\nFui certa vez a um hackaton na Thoughtworks em POA.\nTenho quase certeza que ficava na PUC e a estrutura de lá me pareceu fantástica.\n\n\nO curso no RJ é bem legal e acredito que deva ter a mesma grade em POA. Vale uma olhada.",
      "author": "Leandro Oriente",
      "date": "2014-06-02T14:58:54"
    },
    {
      "message": "Cara não tem muito pra onde correr não, porém Análise e Desenvolvimento de Sistemas e Sistemas da Informação puxam um pouco menos de matemática que Ciência da Computação e Engenharia da Computação.",
      "author": "Leandro Oriente",
      "date": "2014-06-02T14:56:37"
    },
    {
      "message": "@disqus_dOMT09ajdI:disqus se você já tem uma queda por Desenvolvimento, Análise e Desenvolvimento de Sistemas ou Sistemas da Informação podem ser a escolha ideal.\n\n\nNo Rio de Janeiro existem boas opções na UFF, UNIRIO e PUC.\n\n\nA UERJ tem uma pegada bem mais acadêmica e eu particularmente detestei a estrutura do curso e da própria faculdade. A UFRJ se não falha a memória também é Ciência da Computação, além de ser integral e no fundão o que reduz as suas chances de estudar e trabalhar em paralelo.",
      "author": "Leandro Oriente",
      "date": "2014-06-02T14:55:40"
    },
    {
      "message": "Nossa, estou realmente no meio deste processo. Tenho dezessete anos e preciso urgentemente decidir qual curso fazer e se vou realmente fazer algum. Minha família desacredita que eu possa seguir carreira programando, é deprimente, por isto revejo meu futuro todas as horas. O curso que mais parece ser minha praia é Sistemas de Informação da UFF, mas também tenho na lista o Ciências da computação da UERJ. Eu sei muito bem que o segundo não é lá muito prático como o primeiro e também sei que ele é muito voltado aos softwares em geral. Sabendo que costumo programar para websites, sera que você poderia me dar alguma sugestão?",
      "author": "Matheus Souza",
      "date": "2014-06-02T03:43:28"
    },
    {
      "message": "Leandro\n\n\nGostaria muito de cursar essa faculdade de informática,porém,só estou com uma coisa na mente,eu detesto matemática,mas eu até li sobre os cálculos binários e tals,aquilo não seria difícil pra mim aprender,ai eu queria saber se existe mais matemática nesse curso além dos cálculos binários?e outra coisa,são quantos que leva esse curso?desde já agradeço,abraços!!!",
      "author": "Bruno Lemos",
      "date": "2014-05-31T22:37:54"
    },
    {
      "message": "Parabéns pelo Texto! Me ajudou muito!!",
      "author": "Ludmila",
      "date": "2014-05-01T18:56:06"
    },
    {
      "message": "Nossa, estou com a mesma ideia...",
      "author": "Ádamo Maxwel",
      "date": "2014-04-12T23:07:09"
    },
    {
      "message": "Muito obrigado, poxa to muito perdido, uns falam porque você não faz engenharia de softwares outros análise de sistemas, outros indicam ciências da computação... sinceramente auhhuahuauha f............ pois não tenho noção de qual dessas é melhor, mais com sua resposta me achei aqui, vou ver sobre as faculdades. muito obrigado",
      "author": "Ricardo Silva",
      "date": "2014-02-27T20:11:17"
    },
    {
      "message": "Opa Ricardo Silva.\n\n\nO ideal é que você faça Análise e Desenvolvimento de Sistemas (Sistemas da Informação).\nLá você vai ter uma pegada mais voltada a desenvolvimento mesmo. Engenharia ou Ciência da Computação tem um foco mais difundido com outras áreas.\n\n\nQuanto a faculdade, vale a pena dar uma olhada na Infnet também e na Unirio. Tenho conhecidos cursando e me deram excelentes recomendações.",
      "author": "Leandro Oriente",
      "date": "2014-02-27T15:58:58"
    },
    {
      "message": "Fala Leandro muito bom seu tema abordado, estou nessa dúvida, aqui no RJ as melhores faculdades sobre pesquisa em termos de informática é a PUC RJ e UFRJ mais preciso fazer NENEM(ENEM)  pra ter um belo descontou ou até uma bolsa, mais estou nessa dúvida, quero criar programas pra empresas, e aplicativos para as plataformas de IOS e ANDROID ... o que você me recomendaria.",
      "author": "Ricardo Silva",
      "date": "2014-02-27T15:54:44"
    },
    {
      "message": "Belo artigo Leandro. Sinto falta de bons cursos em Porto Alegre. Abraço!",
      "author": "Matheus Kramer",
      "date": "2014-01-19T14:40:17"
    },
    {
      "message": "Obrigado pela atenção! Realmente o curso de Logística assim como a profissão ainda carece no mercado, as formações nessa área são apenas técnica, tecnóloga e depois uma área especifica em mestrado e/ou doutorado. Entrei no curso sem conhecer muito sobre a área e durante o curso fui me identificando com a profissão. No entanto, quero uma formação superior para ingressar no mercado de trabalho. Moro no interior e por aqui não temos curso de Administração em faculdades públicas (privadas não tenho condições de pagar e tbm não houve ofertas de vagas para o PROUNI) que é realmente o que eu quero, e também por proporcionar uma boa formação pra minha base que é a logística. Assim como aconteceu no curso técnico em Logística estou fazendo agora com o ingresso no curso de Sistemas de Informações. Escolhi essa área pois soube que ao término posso me cadastrar como um Administrador, mas não fiz nenhum curso técnico e tbm não tenho nenhuma experiência na área, espero que eu consiga aprender do zero quando começar, assim como foi na Logística.\nMais uma vez, obrigado pela atenção! =)",
      "author": "Matheus",
      "date": "2014-01-14T02:20:24"
    },
    {
      "message": "Opa Matheus, confesso que não tenho condições de te responder essa pergunta.\nConheço muito pouco do campo de Logística.\n\n\nAcho que vale a pena, logo no início do curso, procurar pela informação dentro da própria faculdade.\nÉ uma questão bem específica e não sei se vai achar pela internet.\n\n\nDe qqr forma, boa sorte em sua nova jornada =)",
      "author": "Leandro Oriente",
      "date": "2014-01-14T02:03:55"
    },
    {
      "message": "Olá, gostei muito da sua publicação! No entanto, estou aqui pra tirar uma dúvida que tenho. Sou Técnico em Logística recém formado, e durante o curso me identifiquei bastante com a disciplina de Pesquisa Operacional. Agora estou começando o curso de Bacharelado em Sistemas de Informações, gostaria de saber se com essa formação, seria aconselhável pra que eu faça mestrado em Logística e Pesquisa Operacional, ou eu devo procurar outra área de formação?",
      "author": "Matheus",
      "date": "2014-01-14T01:54:58"
    },
    {
      "message": "Li todos os posts! Excelente! :D\n\nAh! Também trabalhei no Peixe Urbano, por 2 anos. Recebia um excelente salário, SEM formação superior =)\n\nEu entregava resultados. E era isso que mais importava.",
      "author": "Renan Costa",
      "date": "2013-12-27T21:07:25"
    },
    {
      "message": "Opa @brunaediogo:disqus \n\n\nInfelizmente não vou poder te recomendar muitos livros porque larguei a faculdade no segundo período, então tive pouquíssima vivência acadêmica.\n\n\nO que recomendo é que não se preocupe muito com isso agora. As matérias iniciais são bem introdutórias e não ter conhecimento prévio não vai te prejudicar não.\nBasta pegar o ritmo da faculdade e principalmente o dos professores. Eles sim vão poder recomendar os livros certos na hora certa.\n\n\nNão adianta te recomendar um excelente livro de desenvolvimento em C# se só for tocar no assunto pelo quinto ou sexto período, se tocar.\n\n\nUma coisa importante. Não fique presa ao conteúdo mostrado na sala de aula. Procure sempre pesquisar mais informações por fora depois. Em alguns casos a matéria ensinada fica defasada e a faculdade não atualiza a tempo.\n\n\nEspero ter ajudado, um forte abraço e boa sorte na nova jornada =)",
      "author": "Leandro Oriente",
      "date": "2013-12-27T15:53:07"
    },
    {
      "message": "Quais livros você sugere para quem está começando a cursar ciências da computação ?\nObrigada !'",
      "author": "Bruna EDiogo",
      "date": "2013-12-27T15:30:19"
    },
    {
      "message": "Uma coisa é fato! \nQuem faz um bom profissional é o aluno, e não a faculdade. Você pode estudar na melhor faculdade da área, mas se o aluno estiver fazendo o curso só por fazer, não vai dar em nada! \n\nAquele cara que estudou naquela faculdade particular, e pagava do bolso, se esforçava, era dedicado... Vai ter mais sucesso que você, que estudou na melhor faculdade, mas sem foco.\n\nFaculdade, só tira as pedras do caminho, mas quem vai trilhar ele é você! Não se esqueça disso.\n\nMinha experiencia na faculdade, posso dizer que me formei, mas não aproveitei muito. Se tivesse a cabeça que tenho hoje, provavelmente tinha aproveitado muito mais. \n\nEscolher o curso que vai realizar é complicado, talvez uma das escolhas mais difíceis da vida. Se você já trabalha na área ou segue o caminho do Pai, por exemplo, é mais fácil escolher o curso. \n\nMinha mãe é Professora, Pós-Graduada, então fazer faculdade não era questão de escolha heehehe! \n\nEu não consegui passar em uma faculdade publica, na minha cidade só tem a UEM, que por sinal é uma faculdade muito conceituada, porém cursos de TI lá era Ciências da Computação e Informática, e de certa forma, foi até bom que não tenha passado (menos para meu bolso, pois pago minha faculdade até hoje =D ).\n\nNa faculdade particular (CESUMAR) hoje Unicesumar, Tinha várias opções, mas o bolso pesava também, e acabei cursando Análise e Desenvolvimento de Sistemas, basicamente tudo que vi no curso na parte de programação era voltado para Back-End (Java, Delphi, PHP, Banco de Dados e etc). Nesse ponto tenho até uma base boa. \n\nUma dica é você escolher sua linguagem de programação (Se for ser programador) favorita ainda no primeiro ano, e praticar, pois depois de formado, além do canudo será bom em alguma coisa. Não espere o professor mostrar o conteúdo para depois começar a correr atrás, até por que a carga horaria é pouca, e o que ele passa é muitas vezes só o básico (Tirando as pedras do caminho).\n\nEu não acho que escolhi a faculdade errada, mas aproveitei mal o tempo que estive lá. Um detalhe muito importe é analisar muito bem o mercado na sua região, se pretende ficar na sua cidade depois de formado. Na faculdade via muito Java, pois é a linguagem do momento, mais usada no mundo e etc e tal. Porém na minha cidade, o foco ainda é Delphi para Desktop e PHP para Web. JEE e JSE ainda está mais nos grandes centros. Embora Delphi seja uma linguagem em declínio e os programadores mais trabalham dando manutenção em sistemas antigos do que criando novos, ainda na minha cidade e região, tem muita vaga de emprego.\n\nAgora estou finalizando uma Pós-graduada em Desenvolvimento Web na UEM (Universidade Estadual de Maringá), mas depois dessa Pós, pretendo dar uma folga e fica longe da faculdade por um tempo heheheehe, irei investir mais em cursos. ",
      "author": "Bruno Aquino",
      "date": "2013-10-14T17:24:23"
    },
    {
      "message": "Um artigo muito lúcido sobre o assunto. Se tu pensar, nós front-enders somos meio escanteados nas \nUniversidades. \n\nMesmo linguagens em voga na internet, como javascript, ficam escanteadas nas universidades em prol de Java, C, e com muita sorte, PHP e Ruby.\n\nAlguns tem curso superior em outras áreas, que não tem nada a ver com a Computação, e gente muito gabaritada no nosso meio não possui Diploma Superior. Eu mesmo larguei Análise e Desenvolvimento de Sistema na terceira semana de curso, pois não me via sendo back-end.",
      "author": "Mateus Avila Isidoro",
      "date": "2013-09-09T19:08:36"
    },
    {
      "message": "Boa Léo. Bellísimo depoimento =)\nTive um inicio bem parecido com o seu. Antes do ensino médio da brincava num 486 e montei praticamente todos os computadores que tive até comprar o Macbook.\n\nNo momento estou cheio de dúvidas. Não sei bem o que quero a longo prazo. Gosto da ideia de investir em algum projeto pessoal. Mas estou tentado a voltar a vida acadêmica. Até pq depois de ler tudo isso tenho certeza que vai me ajudar.\n\nAcho que vou na resposta do Akita. Na dúvida, faça. Só preciso avaliar bem agora como vou tocar isso e onde.",
      "author": "Leandro Oriente",
      "date": "2013-03-17T17:19:43"
    },
    {
      "message": "Oriente, te contar um pouquinho da minha História:\n\nComecei a me interessar pela área ainda moleque. Meu pai me deu de presente um fichário da Coleção Descobrir (google it) e ela vinha com várias fichas que você podia cadastrar numa espécie de SGBD... só que esse sistema tinha que ser programado... tinha uma folha enorme que vinha com o código fonte escrito que você tinha que copiar pro computador, compilar e tal.\n\nEu achei aquilo mágico, e fiquei fascinado por computadores e essa fascinação me levou a desmontar o velho 386 de casa pra ver como era por dentro... ja era computador.\n\nMeu pai ao invez de arrancar meu couro, me colocou num curso de informatica da época \"vê se arende do jeito certo!\"... era um daqueles cursos estilo SOS Computadores ou Microlins de hoje em dia, que ensinava de tudo... Windows 95, Office 97, Corel Draw 6.. e Internet!\n\nLeia-se por um curso de internet: aprender a mexer no IE4, Netscape 4 e a fazer sites toscos usando tablas no Notepad e no Front Page.\n\nFiquei doido. Abrir o Bloco de Notas e escrever código era mágico pra mim. Mesmo sem ninguém me dizer que aquilo não prestava, o editor gráfico do Front Page não me interessava, eu queria era abrir o Bloco de Notas e escrever código! \n\nInternet naquela época era novidade. Computadores nem vinham com MODEM. Penei pra convencer meu pai a comprar um. Enquanto não tinha, ficava indo na biblioteca pública de perto de casa acessar a web e aprender mais sobre HTML, CSS, JavaScript, PHP, ASP... Eu queria ser um Web Master!\n\nCom esse foco, quando acabei o segundo grau, nada mais natural que inventar de fazer uma faculdade de informatica. Consegui uma bolsa integral e era o aluno mais jovem do Bacharelado de Ciência da Computação da Universidade Gama Filho.\n\nPrimeiro semestre: Algoritmos, Matematica Discreta, Introdução à Computação e Logica Matemática. Só empolgacão. Fui a maior média da turma. CR 9.8.\n\nO tempo foi passando, fui tendo uns professores muito bons, outros muito ruins. Algumas matérias não empolgavam nenhum pouco... CR já era 7.x. Minha familia tava ruim de grana e e arrumei um estágio pra trabalhar com aquilo que eu tinha aprendido quando moleque: HTML e CSS.\n\nEra uma start-up. Cheguei la botando banca que eu ja sabia HTML, XHTML e CSS desde moleque... e que eu era um grande programador (afinal, so tirava de 9 pra cima em qualquer prova de Prog na faculdade)... fui contratado. \n\nAí descobrir que eu não sabia programar porcaria nenhuma, mas que eu era muito bom em HTML/CSS mesmo.\n\nDurante 3 anos fui sozinho o HTMLer do Mundi.com.br (naquela época ninguém falava de front-end)... ganhando uma merreca, mas o suficiente pra largar a faculdade que ja não me animava mais.\n\nForam 3 anos na Gama Filho, o último ano dividido com o estágio sendo empurrado com a barriga, do qual eu sair sem nenhuma vontade de voltar e me forma e com uma visão muito errada de faculdade.\n\nFiquei 4 anos sem entrar numa sala de aula, trabalhei lugares legais, e o diploma poucas vezes fez falta (teve uma vez, numa entrevista na Globosat - não confundir com Globo.com - mas...). No primeiro FrontInRio descobri que eu era uma Desenvolvedor Front-end. Conheci um monte de gente, participei de um monte de eventos, e descobrir o mundo das comunidades... nelas comecei a conhecer caras fodas, que me falavam da importancia de coisas que aprenderam na faculdade. Resolvi que queria voltar e levar mais a sério a parte de aprender a aprender.\n\nPassei pra UFF, Sistemas de Informacão. Curso com a grade bem variada, onde, pelo menos na UFF, dá pra você focar em o que você quer aprender.\n\nTem sido bom. Esse semestre, por exemplo, estou tendo aula com um velhinho que em uma experiência incrível com Business Inteligence, um área pela qual me interesso muito.\n\nA UFF é bem diferente da Gama Filho. Os professores pegam mais pesado, as provas são mais puxadas e dificilmente você consegue passar sem saber algo. Mesmo que você esqueça depois, você teve que estudar e aprender pra passar. O que é importante.\n\nAbri mão de empregos em empresas legais que me impossibilitariam de estar na UFF na hora da aula. Mas eu botei na cabeça que eu quero terminar esse curso, e terminar bem. Tenho feito questão de conhecer meus bons profesores (os ruins eu largo de mão), de pegar o máximo de experiência deles que puder. Conhecer os outros alunos, sejam meus veteranos ou os meus calouros, e aproveitar a vida de faculdade. Não tem sido fácil casar isso com a vida profissional, mas eu espero colher lá na frente coisas melhores do que eu estou deixando pra trás agora.\n\nNegócio é você pesar agora o que você quer pro futuro e as suas necessidades hoje. Você quer continuar sendo desenvolvedor pra sempre? Voce consegue se virar bem aprendendo sozinho? Você pretende fazer mestrado/doutorado? Prefere se focar no mercado? MBA? Quer ser \"gerente\"? Quer um diploma so pra enfeitar a parede? Quer abrir uma startup? Quer juntar uma grana e viver de investimento depois? Quer um dia largar tudo e cuidar de uma pousada numa praia paradisiaca? Quer ter um emprego foda numa empresa foda gringa?\n\nAs suas respostas respostas, pra essas e outras questões, podem te ajudar a decidir que faculdade fazer ou não fazer faculdade. O importante é você focar naquilo que você quere seguir nessa meta, com ou sem a faculdade. \n\nEspero ter ajudado ;)",
      "author": "Leonardo Alberto Souza",
      "date": "2013-03-17T17:13:05"
    },
    {
      "message": "Irado =)\nPretendo voltar no tema e trabalhar nesse esquema meio open source. Curti o resultado final apesar de ser totalmente diferente do original.\n\nVou postar algumas coisas específicas para Desenvolvedores Front End e algumas mais genéricas em breve.",
      "author": "Leandro Oriente",
      "date": "2013-03-16T22:38:20"
    },
    {
      "message": "Opa Professor. Que bom te ver por aqui =).\n\nAcredito que tenha lido a primeira versão do post? Resolvi reformular depois de ter tido feedbacks incríveis, inclusive o seu.\n\nNo momento estou pensando em retornar a faculdade (não na UERJ).\nPretendo correr atrás de algum curso de Sistema da Informação por ser um pouco mais orientado ao mercado, apesar de realmente fechar algumas portas.\nCurti a opção da CEDERJ e sei que não é fácil ou ruim. Tenho um conhecido cursando e ele gostou bastante do curso. Porém não está decidido ainda.\n\nTalvez junte uma grana e me dedique exclusivamente a isso por um tempo e toque projetos paralelos. Na verdade estou bem indeciso, porém, abri minha mente para novas opções =)\n\nEstou me sentindo um pouco limitado no momento. Sei bem como progredir, porém não estou muito entusiasmado com isso.\nAcho que uma boa graduação pode me dar um leque de opções maior além de mostrar novas opções que não tenha visto ainda.\n\nDe qualquer forma muito obrigado pelo feedback. Aproveitei para deixar a mensagem. Sei que muita gente tem esse mesmo tipo de dúvida e acho que pode ser uma informação válida.\n\nAbs,",
      "author": "Leandro Oriente",
      "date": "2013-03-16T22:34:35"
    },
    {
      "message": "Opa amigo. Obrigado pelo feedback.\n\nNessas ultimas horas vi que estava no caminho certo tb. Porém me dei conta que a faculdade não é algo ruim ou um processo inútil. \n\nO importante é achar alguma que vá te agregar valor profissional e não apenas te entregar um diploma no final do curso. Consegui finalmente enxergar isso.\nSinceramente o diploma não vai mudar muito a minha vida agora. Sei o que preciso aprender/estudar no momento e o que vou precisar para evoluir na minha carreira e posso chegar lá sem uma faculdade, mas depois de tudo que li, acho que é válido fazer sim e investir esse tempo em uma boa graduação. \nSou jovem ainda (21) e posso me dar ao luxo de tomar decisões ruins. Se for o caso, largo novamente e volto a me dedicar full time aos estudos por conta própria.\n\nNo momento estou avaliando quais se encaixam melhor nas minhas necessidades atuais e pensando seriamente em retornar aos estudos.",
      "author": "Leandro Oriente",
      "date": "2013-03-16T22:26:20"
    },
    {
      "message": "http://matt.might.net/articles/phd-school-in-pictures/ deve te ajudar na continuação dos posts",
      "author": "João Maia",
      "date": "2013-03-16T22:10:02"
    },
    {
      "message": "Grande João, excelente comentário. \nAssim como você, a maior parte do conhecimento que tenho aprendi por mérito próprio, mas foi preciso um empurrãozinho da faculdade, na verdade de alguns professores. Nunca tinha programado na vida antes de entrar na faculdade, mas já trabalhava com TI e estava começando a usar Linux. Quando fiz meu primeiro \"hello world\" foi sensacional. Tive bons professores, principalmente com assuntos de programação, toda a base que aprendi com as disciplinas iniciais de programação foram importantes para eu aprender outras coisas por conta própria de uma forma mais produtiva. Tecnologia vai e vem todo o tempo, mas os conceitos e paradigmas demoram a mudar ou não mudam, e bons professores te fazem perceber isso. Quem diria que ficar manipulando ponteiro em C pra lá e pra cá iria me ajudar até hoje hehehehe.",
      "author": "hlmerscher",
      "date": "2013-03-16T12:24:17"
    },
    {
      "message": "terminei... apertei em postar sem querer! uahua",
      "author": "João Maia",
      "date": "2013-03-16T03:13:34"
    },
    {
      "message": "Estava curtindo a história cara. O comentário ficou cortado.",
      "author": "Leandro Oriente",
      "date": "2013-03-16T03:04:11"
    },
    {
      "message": "Acho um assunto muito polêmico e todo cuidado é pouco na escrita quando pretende se manifestar sobre.\nAntes de tudo, sou formado em Engenharia de Computação(EC) na UFES e vou contar um pouco sobre meu caso.\nPor volta dos 12-13 anos fui introduzido ao computador com o bom e velho win 3.11, sempre fui curioso com o PC desde aquela época e aprendi várias coisas coisas que lembro até hj: cd. dir, format... mas depois pouco tempo veio a Internet. Tendo a oportunidade de me comunicar com o mundo e junto com o fato que tinha entrado no inglês conheci uma comunidade cracker de engenharia reversa. Criança, achei um barato e divertido aprender assembly e brincar de \"sacanear\" programas. Depois de um tempo larguei de lado e só fiquei com os jogos. Nesse tempo aprendi que gostava de matemática, física e desafios. Chegada a época do vestibular conheci o Linux (Slackware) e tive o msm feeling quando conheci o assembly e desde então passei a usar linux. Na hora do vestibular veio aquela dúvida: matemática, física, eng eletrica, cc ou ec? acabei indo para EC pela quantidade de opções a seguir depois.\nPassei por toda minha graduação dentro da faculdade: projetos, monitoria, estágio e emprego. Aprendi mta coisa e a mais importante: \"aprender sozinho!\". A universidade na minha opinião não deve te formar em especialista X da tecnologia Y. Ela deve formar antes de tudo um cidadão com habilidades profissionais em área X. Basicamente, ela existe para te tirar da sua zona de conforto e te preparar para a realidade e ajudar a te guiar nessa jornada.\nPelo menos foi isso o que aconteceu comigo. Com esse ensino fraco que temos durante nossa formação a graduação é a última chance de vc aprender algo que deveria ser ensinado desde o princípio: aprender.\nDepois que me formei fui para o mercado de trabalho e fui obrigado novamente a sair da minha zona de conforto e trabalhar com coisas que nunca tinha feito. Para minha quase surpresa, não foi complicado pois já tinha aprendido isso na faculdade. O quase foi por conta de um aviso de um prof no quarto semestre: \"Hj vcs não percebem mas quando sairem daqui formados vão ver que td é possível com a base que vcs tem\". Ele acertou!\nNão quero agora dizer que todos devem fazer um faculdade mas acho que pelo menos devem tentar msm que seja algo diferente da sua realidade de trabalho mas algo que te traga satisfação de fazer.\nEntrando agora no caso do trabalhador da área de TI. Acho que a área é mto vasta p/ dizer que não presta fazer CC. Veja no seu caso, pelo que vi vc é Frontend, já pensou em fazer Desenho Industrial ao invés de CC? (Aqui na UFES tem, não sei se ai tem algo do tipo). Talvez o seu perfil não se enquadre ao perfil da CC.\nEsses são alguns dos meus pontos de visão sobre o assunto. No aguardo da continuação do seu texto.\n\n=)",
      "author": "João Maia",
      "date": "2013-03-16T02:55:51"
    },
    {
      "message": "Leandro,\n\nNão ter diploma, aqui no Piauí, não se aplicaria, com a rara exceção de você ter um portfolio interessante (não só de clientes, mas projetos próprios, trabalhos em open source). \n\nAqui, eles querem o diploma. Já vi gente sem noção de programação ser contratado enquanto um autodidata que sabia de verdade ficava a ver navios. Triste, não é?\n\nGostaria muito que esse panorama do Rio se espalhasse por todo o Brasil, mas, isso será meio difícil, mesmo a nossa área sendo tão propícia a essa prática.\n\nDentre os posts, o que acho que melhor complementa o seu é o do Akita ;P Ele mostra bem os dois lados da moeda, como ele conseguiu se sair sem completar os estudos formais, porém, mostrou também que aprendeu muita coisa lá (e recomenda completar os estudos ;P)",
      "author": "Erick Patrick",
      "date": "2013-03-15T23:43:38"
    },
    {
      "message": "Grande Leandro, desejo sucesso pra você! Do pouco contato que tivemos, você me lembra do clichê \"quem faz a escola é o aluno\". É isso: a escola nos coloca num ensino de massa; uns vão rápido, outros vão devagar. O professor tem que tentar ganhar pela média: puxar para cima os mais fracos e não frustar os mais fortes. Mas, pensando na vida, o aluno é quem tem que fazer o seu próprio ritmo; aluno precisa entender que não depende só da escola e do professor para estudar (se fosse assim, não haveria autodidatas). \n\nSobre faculdades, você só faz se quiser! Mas na área de TI eu acho importante. Você demonstra tendência pra preferir cursos para tecnólogo; beleza, tem vários por aí. O único problema é que isso pode fechar as portas pra mestrado depois, porque são mais curtos e não contemplam tudo de uma área (no caso, Computação). Você pode fazer via EAD, sim; parece interessante para quem é disciplinado com estudos e que gosta de estudar sozinho. CEDERJ parece legal, mas não é facil; um colega do trabalho fez, formou-se, mas foi o único da turma original dele.\n\nEu fiz Informática na UERJ, mas já faz tempo...Na época reclamávamos da mesma coisa: um monte de matemática, não vou usar isso nunca, bla bla bla. E olha que na época nosso curso era ligado ao de Matemática: eu tive 2 anos só de matemática. Mas, sabe de uma coisa? O saldo é positivo e infelizmente a gente só percebe depois de alguns anos: o pessoal de Exatas, de tanto contato com as áreas da matemática, ganha um raciocínio lógico-matemático-dedutivo muito bom. Isso ajuda em Programação, Análise, CG, etc...Pegue um cara que fez um curso de Programação e um outro que fez Programação mas tem base de Cálculo, Algebra Linear.... esse segundo cara costuma ter muito mais ideias para solucoes criativas, tem uma capacidade de abstracao maior para modelagem, e por aí vai. Uma coisa puxa a outra. Fora as aplicações matemáticas reais na computação, que outro colega citou noutro comentário.\n\n\nAs empresas sabem disso, pois é muito mais fácil pegar um profissional com essa cabeça e dar uns treinamentos em ferramentas (e provavelmente aprende rápido) do que alguém que sabe só uma coisa ou outra e não aprende mais nada depois. A universidade me ensinou que é preciso \"aprender a aprender\", e até mesmo com professores ruins vc acaba desenvolvendo isso. Vc aprende a ser \"safo\"; perdi a conta de quantas vezes eu saía no meio da aula para estudar na biblioteca, pois aprendia mais lendo um livro. Então, o limão acaba virando limonada. Se não fosse a UERJ, sendo bem pragmático, nem teria passado na 1a. fase da seleção pro meu 1o. estagio (na Vale), e nem teria passado nas etapas na Arthur Andersen, (multinacional, inclusive com uma entrevista em inglês). \n\n\nE não se prenda só na formação técnica. Eu gostaria de ter recebido mais educação para trabalho em equipe, contato com usuários, desenvolvimento de projetos, liderança, visão empreendedora... isso ajuda na montagem de um perfil menos \"escovador de bit\".\n\n\nUm abraço!",
      "author": "Gilvan Vilarim",
      "date": "2013-03-15T20:15:29"
    },
    {
      "message": "Opa Rafael. \nFiz o post com base na experiência (Curta) que eu tive e no feedback de vários amigos.\nCheguei a comentar que existem exceções e posso até citar algumas no Rio de Janeiro.\nUFRJ, PUC e UNIRIO são bons exemplos e meus amigos sempre falam muito bem a respeito.\n\n\nPorém a grande maioria não se encaixa nesse padrão elevado. Um semestre foi mais que suficiente para perceber que não escolhi o curso certo e a Faculdade certa. Foi um erro ter entrado em Ciência da Computação (um erro meu) e um erro maior ter entrado na UERJ (um erro do governo no caso). Tive professores ruins e a estrutura é muito ruim.\n\nO que questiono no post e pretendo deixar mais claro(vou reescrever alguns pontos que notei que estão confusos) é que não é totalmente necessário cursar uma faculdade para pegar esses pontos específicos que você citou. São 4/5 anos de estudo que você pode diluir num período maior conforme sua necessidade e selecionar melhor o que é realmente necessário.\n\nFoi uma escolha minha e já vi excelentes profissionais que partiram pra essa abordagem. Moldar a sua \"grade\" e correr atrás de especialização por conta própria.",
      "author": "Leandro Oriente",
      "date": "2013-03-15T19:12:22"
    },
    {
      "message": "Leandro, acho mt difícil vc julgar uma universidade apenas tendo cursado um período. Vc já concluiu alguma? Se tivesse concluído, poderia comentar sobre isso. Sem conhecer, não acho que sua opinião tem algum valor. Não estou sendo rude, essa não é a intenção. Você poderia ter dito que os períodos q vc cursou não te acrescentaram nada. Mas não pode dizer que SE vc terminasse isso não te acrescentaria em nada, porque vc não sabe o futuro. Vc fez uma projeção, inferiu algo com base nos poucos períodos q cursou e tomou uma decisão muito importante na sua vida. Veja se vc tem base suficiente para tomar uma decisão desse porte ou se está perdendo uma oportunidade de ouro na sua vida.\n\n\nA faculdade pode não acompanhar as tecnologias mais novas do mercado, mas existem várias coisas que uma boa faculdade pode te ensinar e vou listar apenas três:\n\n\n1- base: essa não muda. A base da programação, de bd, td q vc precisa para correr atrás das outras tecnologias mais novas. Ah, vc achou q era só fazer a faculdade e não teria q correr atrás? Quem não corre atrás, fica pra trás. A faculdade te direciona, mas obviamente vc precisa fazer o seu.\n\n\n2- pesquisa: e com isso nao direciono só a quem quer ser pesquisador. Mas a faculdade te a ajuda a desenvolver senso crítico, capacidade de analisar, estudar...\n\n\n3- futuro: na faculdade vc pode não ter contato com as linguagens mais atuais. Mas vc tem contato com as tecnologias do futuro. Sistemas para E-gov, Big Data, Gestão de conhecimento, análise de redes sociais... coisas que ainda não são realidade na maioria das empresas do brasil, mas a cada momento vc ve alguem falando delas. Sim, seus professores já trabalham com elas há séculos e ajudam a construir esse conhecimento q vai sendo consumido aos poucos pelo mercado de trabalho. Pra mim, esse é o ponto q mais me encanta. E conforme vc vai entrando no mundo acadêmico, o futuro vai se mostrando pra vc.\n\n\nSei lá, acho complicado falar do q vc não conhece, rs. Curse a faculdade e depois reveja esse post. Garanto q vc não vai se arrepender (sugiro a UNIRIO, q é ótima e é a unica q posso julgar =D).",
      "author": "Rafael",
      "date": "2013-03-15T19:00:53"
    },
    {
      "message": "Pois é. Na minha condição é inviável dispor desse tempo.\nNão posso me dar ao luxo de investir (meu tempo vale dinheiro) 3/4 horas diárias em algo que não vai me acrescentar valor no momento. Prefiro pegar esse tempo e focar numa nova linguagem, numa nova abordagem e etc.\n\n\nEstamos contratando aqui na empresa. Aproveitei a oportunidade para perguntar para o responsável por recrutar sobre o diferencial que o diploma faz na seleção.\n\nA resposta foi mais ou menos a esperada. \nNenhuma. Não faz a menor diferença se é formado e onde é formado. O importante para a empresa no momento é achar alguém capacitado. Tanto faz se o cara veio de Harvard, da Estácio de Sá ou não tem formação, ele precisa atender aos requisitos da empresa. \n\n\nNo Peixe Urbano não era muito diferente. Existiam profissionais com características acadêmicas das mais variadas e isso pouco influenciava no salário. O que importava era o nível técnico do cara e a maturidade enquanto profissional.\n\n\nSão casos no Rio de Janeio/RJ.\n\nMas como vc comentou e com toda razão. Isso varia muito de pessoa para pessoa. São necessidades diferentes no final das contas e não se pode dizer que uma é certa ou errada. \n\nMeu intuito com o post foi mostrar que a faculdade não é mais algo essencial e que o diploma não vale de nada se não te trouxer novos conhecimentos (uteis).\n\nPostei três links interessantes. Complementam bem o post =)",
      "author": "Leandro Oriente",
      "date": "2013-03-15T17:05:07"
    },
    {
      "message": "Leandro,\n\nComo te falei, não é questão de 4~5 anos ser tempo demais. O negócio é ter tempo para fazer, além da graduação, um curso de extensão e/ou iniciação científica.\n\nNão sei como está o panorama por aí, mas, aqui, no Piauí, pode até dobrar teu salário. Claro, o salário não é muita coisa, sai dos R$670 e vai para os R$1400, mas já é algo que faz o cara querer continuar na Universidade.\n\nSe tu quer mesmo ter um canudo em menos tempo, faça o tecnólogo mesmo. Tem os de Análise e Desenvolvimento de Sistemas que, no geral, ensinam o programar em Java (ou .NET, outras linguagens são bastante incomuns).\n\nQuando fiz vestibular, passei no Instituto Federal e na Universidade Estadual (por onde sou formado). Preferi a Universidade porque me provia mais coisas. Lá dentro, com os projetos de iniciação científica, descobri que queria mesmo era trabalhar com Web. \n\nLogo, posso afirmar que depende muito da pessoa e de como ela vai aproveitar os estímulos de uma certa instituição.",
      "author": "Erick Patrick",
      "date": "2013-03-15T16:49:45"
    },
    {
      "message": "Então Erick, cheguei a comentar no post sobre esse aspecto, da experimentação e visão da área, mas acho que 4/5 anos é tempo demais para isso.\n\nTenho interesse sim em fazer algo mais específico, mais focado, mas não posso levar 4/5 anos para ver opções de algo que já escolhi.\n\nTanto que estou cogitando fazer CEDERJ (ensino a distância tecnologo) para poder conseguir o diploma e ai sim cair dentro de algo que vá fortalecer as skills que eu preciso e que vão abrir novas portas pra mim.\n\nUm canudo de faculdade hoje, não acrescentaria um centavo no meu salário, mas abriria caminho para estudos mais profundos. \nFico chateado de ter toda essa burocracia prévia mas não tenho muitas escolhas.",
      "author": "Leandro Oriente",
      "date": "2013-03-15T16:00:47"
    },
    {
      "message": "Leandro,\n\nBom, particularmente, prefiro o curso assim, uma vez me permite experimentar as diversas áreas e escolher a que mais me identifico. \n\nPara a questão dos *profissionais qualificados* e *cursos focados*, acredito que a extensão universitária sirva exatamente para isso: qualificar e começar a guiar você para uma certa área.\n\nOs cursos de iniciação científica, também, podem ajudar nisso, já que você pode participar de projetos das mais diversas áreas e estudar, mais afundo, a área dos projetos que participar. \n\nClaro, às vezes é complicado ser bolsista e/ou buscar um curso de extensão (universtiário ou não) e conciliar aos estudos da Universidade. Porém, esse é um dos preços que temos de pagar para descobrirmos o que realmente queremos. E isso não é só para computação, serve para qualquer curso.\n\nSe você quer ser especialista mesmo, busque uma especialização (lato sensu) em cima da área que você mais gostou dentro do curso. Se quiser algo mais prático, de mercado, busque um MBA ou um Mestrado Profissional. \n\nEsses dois últimos, geralmente, são ministrados por profissionais do mercado que trazem diversos insights de suas posições além de situações as quais vocês deverão buscar soluções. Alguns estudantes desses dois cursos saem muito bem cotados no mercado de trabalho, mais que os que fazem somente lato sensu.\n\nEnfim, são as dificuldades que temos de passar para conseguir os frutos. Pode ser difícil e te deixar louco, mas, é assim mesmo. Quando os frutos começarem a chegar, você vai estar orgulhoso de si mesmo por ter enfrentado e continuado nesse caminho.",
      "author": "Erick Patrick",
      "date": "2013-03-15T14:54:44"
    },
    {
      "message": "Opa Erick. Conversei bastante com um amigo ontem, dois na verdade e eles mostraram esse ponto também.\n\nPretendo escrever em breve um post sobre os diferentes cursos de Informática. O meu problema nesse caso foi exatamente esse. Não saber qual o foco do curso de Ciência da Computação antes de entrar. Quando eu descobri já era tarde demais.\n\n\n\nA experiência com a UERJ foi ruim em diversos aspectos, não só nesse por ter errado na escolha. A estrutura é péssima e dos poucos professores que tive boa parte era bem ruim. Enfim.\n\n\nUma coisa que não curti muito foi essa larga abrangência de assuntos. O curso de Ciência da Computação acaba tocando em tantos assuntos que no final você não domina nenhum.\n\nNão seria mais fácil ter um curso focado em Computação Gráfica?\nO mercado de trabalho está cobrando profissionais cada vez mais qualificados e para papéis específicos, pq a faculdade não faz isso tb? Começa a fragmentar os cursos para atender ao mercado. No final das contas não é isso que importa? Realização profissional, um bom salário, uma posição privilegiada no mercado?",
      "author": "Leandro Oriente",
      "date": "2013-03-15T14:35:47"
    },
    {
      "message": "Caro Leandro,\n\nEu TINHA o mesmo pensamento que você: \"O que diabos matemática discreta/aplicada, álgebra libear, estatística, etc, vão me ajudar em computação ou, de forma mais específica, programação?\".\n\nPois bem, passei grande parte da Universidade com esse pensamento. Somente nos 3 últimos períodos que fui entender para que aquelas matérias de matemática e física estavam na grande do curso. Depois desse \"estalo\" e passar a entender o porque da existência delas, fiquei extremamente arrependido por não ter me esforçado mais e aprender, de verdade, aqueles assuntos.\n\nMatemática aplicada é essencial para o entendimento do porque um método ou parte de código roda mais rápido que outros. Estatística, por exemplo, é extremamente necessários para Aprendizado de Máquina (ou inteligência artificial, como queira). Álgebra Linear é puta importante para Computação Gráfica (não confunda com mexer no Photoshop, estou falando de criar as imagens, ponto a ponto mesmo) e em criação de jogos. Cálculo Integral tem suas serventias em todas essas áreas que citei, além de redes e várias outras.\n\nO ponto a se levar em conta é: Bacharelado em Ciência da Computação não vai fazer você de um programador, seja de Web, Desktop ou Mobile. Esse curso é destino a transformar você em um cientista, capaz de analisar situações e aplicar o conhecimento matemático adquirido nas soluções para os problemas que, em vários casos, pode-se utilizar programação.\n\nPor exemplo, quando se quer armazenar dados e é preciso uma capacidade muito rápida de leitura desses dados, o que é melhor se usar, um Vetor ou uma Lista Encadeada? E por que? Aqui aplicamos a matemática aplicada, relacionada à minimização do tempo de funções (de busca, nesse caso). Procure por Big O, Little O, Big Teta, Little Teta notations e achará parte da explicação (prepare-se para a matemática xP)\n\nOutro exemplo: saber o porque que uma função recursiva é considerada custosa e como criar essa mesma função recursiva de forma que seja otimizada ou ainda criar uma função que obtenha o mesmo resultado, porém, sem a necessidade da recursão e, depois, verificar se ela é mais rápida ou devagar que a original.\n\nNum ambito geral, quem gosta de praticar otimização de códigos, de banco de dados, de redes, etc, é obrigatório saber essa matemática enfadonha e chata.\n\nSe alguém pretende fazer mestrado e quer levar para um lado que tenha programação, saber esses conceitos é requisito básico, além de estrutura de dados e métodos de busca (que são extremamente ligados aos conceitos matemáticos estudados).\n\nHoje, sou aluno especial do Mestrado em Ciência da Computação pela UFPI, espero conseguir minha vaga próximo ano e minha pesquisa é sobre Testes de Usabilidade de Aplicações Web. Garanto a você, sem esses conhecimentos, não conseguiria ajudar a desenvolver essa pesquisa e escrever os artigos necessários para demonstrar ao mundo as descobertas e práticas utilizadas na pesquisa.\n\nAcredito ter mostrado o outro lado da moeda e espero ter ajudado nessa discussão.\n\nAbraço,",
      "author": "Erick Patrick",
      "date": "2013-03-15T14:14:41"
    },
    {
      "message": "Concordo bastante com você.\n\nEu fiz Licenciatura em Computação, o curso tem bem menos matemática que Ciência em Computação, mas tem muitas outras coisas não relacionadas com informática, que abrangem a área de pedagogia. Coisas que eu meio que não uso todo dia. E mesmo nas matérias de computação, tem bastante coisa que eu \"não uso\". O legal da faculdade é que ela te dá uma base para começar a procurar seu caminho sozinho nesse mundo de informações que temos disponíveis em livros e na Internet. Minha graduação não foi excelente, mas tive alguns bons professores e o que eles me ensinaram é que me deram condição de continuar sozinho depois da graduação.\n\nLá eu não vi uma vírgula de javascript, css, php e bem, mas bem pouco de html (nem de doctype falamos). Mas teve um trabalho que me despertou para o HTML e resolvi fazer com esta linguagem. A partir daí fui descobrindo o CSS e o JavaScript. E o professor estava ali para dar todo o apoio que eu precisasse. Eu nem sabia que existia o JavaScript, até ele me dizer que essa belezinha poderia resolver meu problema. É um ambiente rico, e às vezes você tem colegas que também tem um grande conhecimento que você também quer ter. Então é outro bom lugar para conviver com essas pessoas, além dos grupos, comunidades e afins.\n\nTem também quem não consegue se organizar para estudar sozinho e acaba totalmente perdido, tendo péssima experiência em fóruns e grupos... A faculdade ajuda. Existe um plano do que ele vai aprender e ele abdica da responsabilidade de fazer essa organização. E aí ele vai aprendendo o básico e conforme vai precisando aprender novas coisas, corre atrás.\n\n\nMeu maior problema com as graduações, na verdade, são os alunos que estão ali só pelo diploma ou porque acham que computação é mexer no Facebook. Eles atrasam a turma, os professores não podem ir além do básico do programa... é um saco. E tem gente que não leva o menor jeito para a coisa.\n\nCerta vez contratamos um camarada aqui que, apesar de simpático, não tem cabeça de programador, e é graduando de Ciência da Computação. Não tem um bom raciocínio lógico e isso é o mais importante. Ele poderia se dar bem, quem sabe, fazendo outra coisa dentro da área de TI, mas não programando. Claro que vamos aprimorando nossa lógica conforme estudamos e praticamos, mas tem aquele básico que \"nasce\" com você, não dá pra ser aprendido. E ele não tinha isso. Muitos que não têm acabam fazendo outra coisa, alguns não se atentam pra isso.",
      "author": "beeblebrox3",
      "date": "2013-03-15T11:59:27"
    },
    {
      "message": "Grande Leandro, seu post está muito massa meu querido, eu tenho o mesmo pensamento critico que você, até hoje as 2 faculdades que cursei não me levaram muito longe. Se estou onde estou é graças as dezenas de livros que li, os eventos que fui os profissionais que conheci e as comunidades que participo. Para não dizer a totalidade mas na minha faculdade 95% da turma esta fardada a continuar sem emprego ou continuar no emprego que esta, ganhando um salário miserável e trabalhando horas e horas. Se você chegou a esse ponto posso te considerar um profissional completo, pois quando passei a pensar assim como você as portas se abriram, oportunidades começaram a cair do Céu. Ser autodidata também não é para qualquer um precisa ser fodinha haha. Uma braço até seu próximo post.",
      "author": "Anonimo",
      "date": "2013-03-15T04:44:54"
    },
    {
      "message": "Muito bom o post, parabéns!",
      "author": "Ricardo Arrigoni",
      "date": "2013-03-15T04:34:04"
    }
  ],
  "freelancer-como-cobrar-por-um-freelance": [
    {
      "message": "Tu é d+ cara. tenho 25 anos de freela e não tinha visto algo tão bem explicado..vou aplicar principalmente a parte de cobrar por partes e não 50% com achava certo, to fazendo um orçamento agora mesmo e com muito medo de me dar mal.. valeu mesmo.. Grande abraço e +sucesso!",
      "author": "Ivanilson Ribeiro",
      "date": "2016-07-01T05:39:39"
    },
    {
      "message": "Trabalho como freela em Marketing Digital há quase um ano, mas fazia gerenciamento de mídias sociais apenas para um cliente fixo. Recentemente, peguei outro freela de gerenciamento e levei um baita calote no esquema dos 50%. Perdi horas fazendo book fotográfico da empresa, criando logo e diversas coisinhas que ele me pediu. No dia de assinar o contrato e receber os primeiros 50% (pasme, eu realmente não soube como cobrar, já que meu primeiro cliente sempre foi muito correto em relação a isso e sequer recebi os primeiros 50% desse cliente em questão) o cara veio com uma desculpa e marcou para outro dia. Depois de cobrar mais algumas vezes, ele continuou enrolando, inclusive inventou morte na família. Apesar do prejuízo que tive, aprendi uma valiosa lição - nunca confie em ninguém! \nEsse cara, infelizmente, sou eu. Adorei seu post e tomei a iniciativa de cobrar antecipado por todo o trabalho no futuro. Dias difíceis, esses que vivemos.",
      "author": "Anna",
      "date": "2016-03-10T04:42:25"
    },
    {
      "message": "Leandro Oriente Fantástico, já li muitos artigos sobre quanto e como cobrar,\nmais com toda sinceridade o seu foi melhor. Obrigado!\nObs.: na questão de como pagar, já tive problemas de receber 50% antes e 50% depois. Hoje recebo tudo. é mais confiante",
      "author": "Aderson Teixeira",
      "date": "2016-01-23T19:47:55"
    },
    {
      "message": "There is no free lunch meu amigo.\n\nSe quiser trabalhar de graça ajude ONG`s, projetos open-source, abrigos, escolas públicas...\n\nSe quiser ganhar experiência procure um problema e tente resolver. Existem centenas deles por ai esperando uma solução. \n\nAgora trabalhar de graça para alguém fazer dinheiro com seu suor não rola em hipótese alguma.",
      "author": "Leandro Oriente",
      "date": "2015-12-17T17:13:43"
    },
    {
      "message": "estou estudando métodos ágil não se encaixaria bem nisso a visão do scrum? ai vc cobraria por interação",
      "author": "angelilton silva",
      "date": "2015-12-17T16:45:50"
    },
    {
      "message": "mais um ótimo post, estou começando com front-end, e até parece engraçado mais todo mundo fica pedindo um site ou a quele sistema básico para ajudar a vida. sei que muita agente fala que no inicio e bom não cobrar e tal é fazer pela experiencia, mais penso o seguinte. a pessoa vai usar aquilo para ganhar dinheiro? se sim porque você também não pode ganhar um pouco, a final SO e pago (mesmo os open vivem de doação) vc tem custos para aprender (cursos, palestras etc) fora coisa básicas internet energia. \no que vocês pensam sobre isso?",
      "author": "angelilton silva",
      "date": "2015-12-17T16:39:39"
    },
    {
      "message": "Opa @ianpierre:disqus  boa tarde.\n\nCara, com uma base de conhecimento razoável em HTML, CSS e Javascript você já consegue lidar bem com interfaces. Na outra ponta você já tem domínio de uma linguagem (Java).\n\nAcredito que expandir um pouco para PHP seja interessante para quem pretende pegar freelances. Boa parte dos CMS do mercado são desenvolvidos em PHP e isso vai facilitar muito a sua vida nos casos mais triviais. Existem diversas opções nesse sentido que resolvem sites simples, blogs e e-commerces como Wordpress, Joomla, Magento, Drupal e etc.\n\nTambém recomendo que de uma olhada em SEO. Pelo menos o básico para não cometer erros grosseiros e que aprenda a configurar manualmente um servidor (os casos mais simples são triviais de configurar). Isso vai te poupar estresse e dinheiro com as hospedagens locais e abrir um leque de opções bem maior. Recomendo que olhe a <a href=\"https://www.digitalocean.com/?refcode=a89d638e17ff\">Digital Ocean</a> e o Heroku.\n\nÉ altamente recomendável trabalhar em parceria com um bom Designer ou estudar profundamente a área. Os erros mais grosseiros que você pode cometer vão estar sempre relacionados ao Design.\n\n\nBoa sorte na sua empreitada :)",
      "author": "Leandro Oriente",
      "date": "2015-11-30T13:03:02"
    },
    {
      "message": "Leandro, muito bom o post. Tenho uma dúvida que tem me consumido há um tempo e seria legal se você ou algum outro desenvolvedor me respondesse. Aprendi HTML e CSS e diria que estava no nivel intermediário (se bem que é dificil mensurar isso). Agora estou estudando HTML5, CSS3, JS (lembrando que ja sei programar em JAVA), Jquery. Qual seria o requisito mínimo para começar a fazer trabalhos como freelancer? \n\nObrigado desde ja!",
      "author": "Ian Pierre",
      "date": "2015-11-30T07:45:34"
    },
    {
      "message": "Opa Gabriela. \n\n\nEu gosto de ter um valor mínimo. Esse valor eu aplico pra qualquer serviço que vá me tomar pouco tempo. Não importa se vão ser 2 horas ou meia hora, não faço nada abaixo desse mínimo.\n\n\nNa época que estava começando cobrava cerca de R$ 300,00 por esses serviços rápidos.",
      "author": "Leandro Oriente",
      "date": "2015-10-15T16:23:57"
    },
    {
      "message": "Ola, adorei o post, esclareceu muitas duvidas.\nMas dias desse,como novata na área fiquei na duvida de quanto cobrar. Achei um freela,onde eu só precisaria redesenhar um logo ja pronto,para assim aumentar sua resolução já que o dono dele não tinha uma versão vetor. Quanto cobrar nessa situação?",
      "author": "Gabriela",
      "date": "2015-10-15T15:54:26"
    },
    {
      "message": "Muito bom o post! Parabéns e obrigado por compartilhar!",
      "author": "Henrique Schreiner",
      "date": "2015-08-31T18:18:59"
    },
    {
      "message": "Busquei no google justamente essa questão de quanto cobrar por um freela e de cara adorei esse post! Tão rápido já fui vasculhar mais coisas bacanas por aqui e estou adorando tudo! rs",
      "author": "Amanda",
      "date": "2015-07-09T01:56:34"
    },
    {
      "message": "Cara belo Post!",
      "author": "Matheus ilario",
      "date": "2015-07-03T19:29:33"
    },
    {
      "message": "Agora sim uma luz no fim do túnel! Cara já passei por muitos problemas como o que você citou acima. Ainda mais quando era experiente e queria de qualquer forma novos projetos para poder ter no portfolio, maldita hora que pensei dessa forma :(.\n\nAjudou muito cara! Valeu",
      "author": "Fernando",
      "date": "2015-06-05T20:29:34"
    },
    {
      "message": "Muito boa a dica :) estou com um probleminha para orçar um projeto mas agora deu uma clariada. Obrigada!",
      "author": "Guest",
      "date": "2015-04-21T00:34:39"
    },
    {
      "message": "Muito boa a dica :) estou com um probleminha para orçar um projeto mas agora deu uma clariada. Obrigada!",
      "author": "Laís Wehner",
      "date": "2015-04-21T00:32:02"
    },
    {
      "message": "Olá Leandro , preciso de uma dica mais especifica com relação a valores . Sou graduando em analise e desenvolvimento e tenho recebido pedidos de desenvolvimentos de pequenos projetos , qual seria o valor adequado por hora ? fiquei nessa duvida, afinal quero ser correto com os clientes com relação a valores .",
      "author": "Leandro",
      "date": "2015-03-11T23:30:11"
    },
    {
      "message": "Leandro Oriente, muito bom o seu post, vou adotar a técnica de cobrar por módulos, é realmente importante que o cliente esteja ciente dos valores e tempo de trabalho. Parabéns cara.",
      "author": "Renan Barbosa",
      "date": "2015-03-09T13:24:18"
    },
    {
      "message": "Ótimo post, é a segunda vez que eu leio ele ahhaah (:\n\nEntão Leandro, estou com uma dúvida que talvez você consiga sanar.\nDigamos que você irá desenvolver um sistema que um cliente seu propôs, o que levará você a decidir se esse sistema se tornará um produto ou algo específico para o cliente?\n\nComo você cobraria um produto? periodicamente? e como você calcularia o preço do seu produto?",
      "author": "Jonas Eduardo",
      "date": "2015-02-23T15:48:19"
    },
    {
      "message": "Ótimo post! Valeu!",
      "author": "João Paulo Fricks",
      "date": "2015-01-21T14:29:13"
    },
    {
      "message": "Você depois de modularizar o projeto chegou ao valor de R$ 5.000,00.\nRecomendo que não cobre R$ 2.500,00 no início e o restante no final.\n\n\nVejo quanto tempo vai gastar por módulo e no módulo sim, escolha o melhor formato de cobrança. O bom de pegar adiantamento no módulo é que você se blinda de começar a trabalhar sem receber nada.\n\n\nEx: \nTotal do projeto: R$ 5000,00 ( 100 horas x R$ 50,00/hora).\n\nPrimeiro módulo: Infra do projeto, total de horas: 10\nNesse módulo você pega um adiantamento e no final da entrega pega o restante.\n\n\nSegundo módulo: Layout, total de horas: 25\n...\n\n\nO importante é dividir bem o projeto e ir cobrando conforme vai entregando. Nunca deixe pra cobrar somente quando estiver tudo pronto.",
      "author": "Leandro Oriente",
      "date": "2015-01-21T13:45:08"
    },
    {
      "message": "Somei as horas de todos os módulos que vão ser desenvolvidos e multipliquei pelo valor cobrado por hora.\n\n66*28 = 1.848.",
      "author": "Leandro Oriente",
      "date": "2015-01-21T13:40:26"
    },
    {
      "message": "Fala Leandro, excelente artigo, eu deveria ter lido há 6 meses, antes de ter iniciado o projeto q estou envolvido agora, o cliente se encaixa em tudo que vc falou aí no post! \n\n\nSó me esclareça uma dúvida, no início vc recomenda para não cobrar metade no início e metade na entrega, pois é uma das piores formas de negociar com o cliente, e logo nos parágrafos seguintes vc recomenda cobrar 50% no início e 50% na entrega nas etapas do projeto. Poderia me explicar melhor?\n\nAbraço!",
      "author": "Arnaldo Alves",
      "date": "2015-01-20T12:43:26"
    },
    {
      "message": "Opa beleza ? cara multiplica pelas horas certo, mas como chegou aquele valor de 1.800 ?. irá acrescentar algumas horas a mais e a menos para se tornar seguro ?\n\n\naté",
      "author": "guilhermeh2",
      "date": "2015-01-17T14:54:25"
    },
    {
      "message": "Agradeço pelo texto! Já publiquei artigos abordando o tema. O mais recente é esse: \n\nhttp://primaerp-pt.blogspot.cz/2014/11/estudo-de-caso-escola-de-idiomas.html\n\nRecomendo esse outro, que é um pouco mais antigo (dividido em duas partes):\n\nParte 1: http://primaerp-pt.blogspot.cz/2014/09/otimizando-seus-ganhos-com-pacotes-de.html\n\nParte 2: http://primaerp-pt.blogspot.cz/2014/10/otimizando-seus-ganhos-com-pacotes-de.html",
      "author": "Andrea Prima",
      "date": "2014-11-24T15:47:04"
    },
    {
      "message": "Para contribuir, apresento um artigo sobre \"formato\" de cobrança:\n\nParte 1: http://primaerp-pt.blogspot.cz/2014/09/otimizando-seus-ganhos-com-pacotes-de.html\n\nParte 2: http://primaerp-pt.blogspot.cz/2014/10/otimizando-seus-ganhos-com-pacotes-de.html\n\nO autor sugere que  se venda o tempo em \"pacotes\" acordados antecipadamente.\n\nAproveitando a oportunidade, desenvolvemos um software que registra o tempo de trabalho, produz relatórios para cobrança e cria faturas. A quem interessar, veja em www.primaerp.com",
      "author": "Andrea Prima",
      "date": "2014-10-16T12:29:02"
    },
    {
      "message": "Entendi. A função não tem pelo visto então (ou está desatualizado o site ali).. O que tem é na hora de escolher o tipo da nota, daí aparece programação (pensei até que fosse correspondente com as funções, também não sei se isso varia de município para municipio). Mas enfim, valeu pelas dicas sobre o MEI. Pelo visto é uma alternativa que pode ser feita (faço a mais de 1 ano já), mas que tem uma linha meio tênue entre estar regularizado ou não com a fiscalização do Estado (caso e/ou quando houver).",
      "author": "Tiago Roberto da Silva",
      "date": "2014-10-15T16:51:51"
    },
    {
      "message": "Tem programação? Não achei não. \nEstou olhando aqui: http://www.portaldoempreendedor.gov.br/mei-microempreendedor-individual/atividades-permitidas\n\n\nSe não me engano desenvolvimento (fron/back/design) em geral não entra por ser atividade intelectual.",
      "author": "Leandro Oriente",
      "date": "2014-10-15T16:41:00"
    },
    {
      "message": "Opa.. Legal cara! Tens toda a razão em relação ao MEI! Só tenho uma observação que é que ultimamente mudou um pouco sobre isso se não me engano. Agora aparece lá \"programação\" para você ser (mas a ideia juridicamente falando é cada vez mais regularizar/especificar os campos né, que é uma tarefa difícil pois até o próprio campo nunca é totalmente definido (front, back, designer, etc) hahaha). Enfim, foda o MEI não ser bem serio numa área com bastantes freelas né, nem que seja generalizando tipo \"web designer\" mesmo. Mas agente vai levando e torcendo para essas análises manuais entenderem os casos de quem trabalha pra ganhar o pão kkk",
      "author": "Tiago Roberto da Silva",
      "date": "2014-10-15T16:01:13"
    },
    {
      "message": "Eu me revejo na experiência do amigo do teu amigo Leandro. Aqui em Angola já me ferrei e fui ferrado por vários clientes (emocionados) que contratam um serviço e, por capricho, desaparecem deixando o projecto a meio. Aprendi a lição e, agora, prefiro cobrar por parcelas. Ninguém sai prejudicado.\nÉ um post muito esclarecedor sobretudo para os que estão a iniciar, que pensam que ser freelancer é canja!",
      "author": "Creavistudio",
      "date": "2014-10-15T15:52:26"
    },
    {
      "message": "Vlw @anemichalewicz:disqus :)",
      "author": "Leandro Oriente",
      "date": "2014-10-15T15:31:48"
    },
    {
      "message": "Opa @tiagorobertodasilva:disqus  muito irado seu comentário cara. Complementou muito bem o post.\n\n\nTenho apenas uma ressalva em relação ao MEI. Infelizmente ele não é válido para desenvolvimento de sites/softwares juridicamente falando.\n\n\nÉ útil para fornecer um CNPJ válido, mas caso sua empresa caia numa análise manual vai dar problema.\n\n\nOu você emite uma nota com um serviço que não condiz com o que foi feito e torce pro cliente não questionar, ou emite errado e reza pra não dar problema.\n\nCancelei recentemente o meu MEI. O correto se não me engano é ME (Micro Empreendedor)/SIMPLES mas nesse caso a burocracia e taxas são bem maiores.",
      "author": "Leandro Oriente",
      "date": "2014-10-15T15:27:49"
    },
    {
      "message": "ótimo post! parabéns!! \n\n\ntenho algumas experiencias com isso também e seu post me motivou a compartilhar .. \n\n\nFreelas Workflow\n\n- Uma alternativa interessante para freela é fazer o MEI (micro empreendedor individual). No caso você terá um cnpj e poderá emitir nota fiscal (diversos clientes pedem emissão de nota fiscal para contratar serviços). \n\n- Além disso com o cnpj você pode abrir conta pessoa jurídica em banco (indico cooperativas pois as taxas são absurdamente baixas), e com a conta no banco você pode emitir boletos e tal, que decididos em reunião com o cliente, você só envia e eles pagam.\n\n- Também tem os diversos softwares e sites que ajudam freelas a ter organização com orçamentos, clientes, pagamentos, entradas, saídas, etc. Eu uso o Trello hoje em dia pois gostei da ideia, e também estou migrando do \"google excel\" kkk, mas tem por exemplo o Fusion Invoice, https://www.fusioninvoice.com/ (já usei e é bem legal mesmo!!) Nesse (app que você coloca em seu host/banco de dados) é bem focado para freelas, tem por exemplo uma ferramenta de orçamento que você faz ele, daí gera-se uma página com link, que você envia para o cliente, e o cliente tem a opção de aceitar ou negar online direto na página. No caso você recebe só a notificação se deu certo ou não. Enfim, ideias bem bacanas nesse app que era free e agora é pago, daí parei de usar kkk mão de vaca é foda.) \n\n- Google agenda serve como alarme e como organizador.\n\n- Mailchimp também é bom para fazer email marketing com novidades e oferecimento de produtos para clientes antigos ou novos prospects.\n\n- Git e Github é bom para manter atualizado exatamente tudo q você faz em seus projetos de códigos e tal.\n\n- Google Drive é muito bom para fazer toda a organização de documentação e envio/compartilhamento do que acontece em reunião, processos, serviços, etc. E serve também como host, renderizar sites estáticos (e etc)\n\n- LICEcap é legal para gravar alguns gifs animados do que você está fazendo e mandar para o cliente ver (tipo mudanças, explicações, etc (ferramenta que descobri recentemente e ta sendo interessante)\n\n- https://unsplash.com/ descobri para buscar imagens bacanas e free\n\n- tweetdeck para manter diversas fontes de informação e conhecimento centralizados.\n\n- google/youtube sempre ajuda nas dúvidas. geralmente no inglês tem mais, porém no br tem mta coisa (assim como stackoverflow, ver um jsfiddle, ler blogs técnicos, etc)\n\nBom, apenas algumas dicas que uso diariamente.. \n\nEm relação às dificuldades, existe por exemplo a parte da prospecção (busca por novos clientes/parcerias) que geralmente sai do campo de web dev e de fato requer a interação desde os contatos iniciais até fazer contrato/receber pagamento etc. Enfim, ferramentas como adwords ajuda na busca de novos contatos, assim como as citadas lá em cima para manter o contato. E redes de relacionamento \"ao vivo\" também conta com certeza.. \nAs vezes penso que antes de ter um sócio/funcionário para ajudar no desenvolvimento técnico (que feito de forma organizada e algumas madrugadas kkk, podem ser cumpridos), vale mais ter alguém para focar na área de publicidade e propaganda, para manter fluxos de trabalho mais lineares. Pois estar com 3 clientes em 1 e nenhum em outro, as vezes pode trazer fases de crise.\n\n\n\nÉ isso aí.. parabéns pelo post mais uma vez!",
      "author": "Tiago Roberto da Silva",
      "date": "2014-10-15T13:57:50"
    },
    {
      "message": "ótimo post! parabéns!!",
      "author": "Guest",
      "date": "2014-10-15T13:06:20"
    },
    {
      "message": "Poxa Leandro, Parabens pelos Artigos são muito bem explicados, linguagem descontraida e dinâmica,  e obrigada por sempre responder com muita atenção todos os comentários. Conheci vocês através do tableless.com.br, citado em um artigo e vejo que tanto um site quanto outro são ricos em conteúdo e dicas de web, estou a muito tempo \" em minha zona de conforto\", kkk tenho muitas idéias porem, para executá-las preciso me atualizar mais parei nas tabelas ainda (viu a coisa ta feia cara kkkk)  então to super atrazada nos conteudos, e estou usando o site de vocês para estudo e atualização também. Resumindo obrigada as publicações tem me ajudado muito. Parabens mesmo Leandro.",
      "author": "Ane Wicz",
      "date": "2014-10-09T11:49:45"
    },
    {
      "message": "Put's cara, bom demais!!!",
      "author": "Aurélio Paz da Luz",
      "date": "2014-08-16T03:02:29"
    },
    {
      "message": "Irado Evandro Peixoto =)\n\nA dica da taxa de translado é muito boa e limitar o tempo de manutenção é essencial tb.\n\nQuanto as novas features eu curtia cobrar em pequenas entregas porque isso ficava transparente pro cliente. O que você pediu leva 4 horas, se quiser mudar esse ponto vai levar 6 horas.",
      "author": "Leandro Oriente",
      "date": "2014-07-31T18:08:40"
    },
    {
      "message": "Já fiz muito freela e conheço outras pessoas. Então vou compartilhar alguns pontos de aprendizado.\n\n\"O homem inteligente aprende com seus erros e com o dos outros.\"\n\nTente mensurar um tempo pra visitas, treinamentos, muitas vezes o cliente quer ver a sua cara lá na empresa dele, então separe um tempo pra isso. O mundo está tão virtual que ele deve achar que você é um boneco 3D.\n\nEu cobrava uma taxa que eu chamava de \"Taxa de Translado\". É o tempo de deslocamento, as vezes o cliente quer que você vá ate a empresa dele mas você gasta 1 hora pra ir e mais 1 hora pra voltar, quer dizer , perdeu esse tempo no transito e no final cobrou somente por 1 hora de visita.\n\nÉ um negócio, é uma troca, você quer o dinheiro e ele quer o serviço.\n\n- Faça check point de entrega,  assim você pode seguir o passo adiante com a certeza de que entregou.\n- Alterações são normais, mas avalie o impacto e se possível leve-as para o final em um novo projeto/orçamento\n- De um prazo de garantia para cada tarefa, e um prazo no final do projeto senão 1 ano depois ele vai te ligar e falar que seu sistema está com erro e você tem que acertar.\n- Defina um horário, um meio para falarem com você. \"Por email ou por telefone diariamente de segunda-sexta das 9:00 as 20:00\".\n- Se entregar o projeto e o cliente quiser manutenção, deixe bem definido o tempo de atendimento senão irá acontecer o que o Anderson Aguiar escreveu no comentário \"Vão te ligar no domingo as 23:00\".\nVocê tem que ter lucro ou algum benefício, já fiz trabalhos com custo baixo para aplicar em alguma nova tecnologia, mas isso tem que ser bem ponderado para nao virar um dor de cabeça.",
      "author": "Evandro Peixoto",
      "date": "2014-07-31T17:36:03"
    },
    {
      "message": "Muito bom post!",
      "author": "Renato Contaifer",
      "date": "2014-07-31T12:12:06"
    },
    {
      "message": "Parabéns Amigão...!!! muito boa as suas dicas ^^,",
      "author": "Bruno Caldeira",
      "date": "2014-07-30T20:24:45"
    },
    {
      "message": "Muito bom o post Leandro, parabéns!\nEu costumo usar meus clientes de experimentos para tentar aprender novas tecnologias, sempre deu certo. Esse é a única coisa que me motiva a fazer freela.\nGrande abraço.",
      "author": "Victor Ferraz",
      "date": "2014-07-30T11:05:03"
    },
    {
      "message": "Sensacional.",
      "author": "Fernando",
      "date": "2014-07-30T01:11:18"
    },
    {
      "message": "Ainda tem isso né @andersonaguiar:disqus.\n\nSempre tentei definir bem horários de reuniões e limitar o contato a isso.\nSe der muita liberdade, hora ou outra o cliente vai estar batendo na sua porta as 04:00 da manhã.",
      "author": "Leandro Oriente",
      "date": "2014-07-29T19:47:15"
    },
    {
      "message": "Sim sim @disqus_YDEoWqFSEe:disqus a idéia é justamente essa, só que fragmentando ao máximo.\n\nQuando mais fragmentado forem as entregas e pagamentos mais envolvido o cliente fica e mais rápido fica o desenvolvimento do projeto.\n\nBoa parte dos projetos atrasam ou desandam por desinteresse do cliente, por incrível que pareça.",
      "author": "Leandro Oriente",
      "date": "2014-07-29T19:43:57"
    },
    {
      "message": "É bom citar também o horário de atendimento, o que mais tem é cliente inconveniente que te liga no domingo às 23h para te perguntar alguma coisa.\n\n\nBelo post! As pancadas da vida nos fazem amadurecer :D",
      "author": "Anderson Aguiar",
      "date": "2014-07-29T16:35:03"
    },
    {
      "message": "Muito bom o artigo cara! Já trabalhei como freela em tempo integral e estava quase abrindo minha agencia, mas acabei desistindo justamente por não saber como cobrar corretamente. Fazia no esquema 50/50 e acabei tomando vários calotes. Como alternativa ao método que você passou sugiro também parcelar o valor integral em 3 ou 4 meses, começando a pagar no inicio do projeto. Assim o cliente vai pagando enquanto o projeto vai sendo desenvolvido e tem uma data certa para pagar a ultima parcela.",
      "author": "Diego Pereira",
      "date": "2014-07-29T16:29:19"
    },
    {
      "message": "Ótimo artigo. Muito instrutivo!",
      "author": "Wiliam Felisiak Passaglia Cast",
      "date": "2014-07-29T14:50:39"
    },
    {
      "message": "Excelente e muito útil pra quem está, assim como eu, começando a me envolver nessa coisa de Freela! kkk ;D",
      "author": "William Oliveira",
      "date": "2014-07-29T14:30:55"
    },
    {
      "message": "Irado!\n\n@PauloBlob:disqus vi que ta saindo pra Android também.\n\nNão pensa em uma solução web? 90% do tempo em que estava trabalhando como freela era com um notebook mesmo.",
      "author": "Leandro Oriente",
      "date": "2014-07-29T13:45:07"
    },
    {
      "message": "Belo artigo parceiro, eu também fui freelancer durante muito tempo e resolvi criar uma solução para esse problema, um app. www.traktopro.com . Você pode dar uma olhada lá, mais de 5000 profissionais e empresas já utilizam.",
      "author": "PauloBlob",
      "date": "2014-07-29T13:31:45"
    },
    {
      "message": "Muito bom, parabéns!",
      "author": "Jonata Cardoso de Souza",
      "date": "2014-07-29T13:22:15"
    },
    {
      "message": "Caiu em boa hora então =)",
      "author": "Leandro Oriente",
      "date": "2014-07-29T12:56:45"
    },
    {
      "message": "Muito bom o artigo amigo, parábens!",
      "author": "João Pedro Nascimento",
      "date": "2014-07-29T12:53:31"
    },
    {
      "message": "Excelente post, cara!",
      "author": "beeblebrox3",
      "date": "2014-07-29T11:55:33"
    },
    {
      "message": "Nossa cara por incrível que pareça hoje vou ter uma reunião com um dono de uma revendedora de carros para tentar fechar um acordo com ele. Gostei muito do seu post. Estou iniciando quase intermediando rsrs e pretendo me tornar um Dev Front-End, e seu post sobre isso está me ajudando muito. ;\nVllw ae.",
      "author": "Misael Santana",
      "date": "2014-07-29T06:08:17"
    }
  ],
  "guia-de-estudo-front-end": [
    {
      "message": "Muito bom! Uma outra dica importante: construa coisas! \nNo fim, é a melhor maneira de aprender.",
      "author": "Guilherme Rodrigues",
      "date": "2013-10-17T11:10:09"
    }
  ],
  "meu-ambiente-de-trabalho": [
    {
      "message": "\"O mercado está cada vez mais maduro e estou muito feliz em fazer parte disso tudo.\"\n\nEngraçado, disse quase a mesma coisa em um grupo do Facebook ontem, recompensadora essa sensação né?",
      "author": "Felipe Fialho",
      "date": "2013-10-09T17:32:07"
    },
    {
      "message": "Sucesso!",
      "author": "Lucas",
      "date": "2013-09-21T11:49:30"
    },
    {
      "message": "Breve no setup do loop infinito !",
      "author": "João Pedro Nascimento",
      "date": "2013-08-26T20:41:58"
    }
  ],
  "meu-nome-e-leandro-e-sou-um-ex-viciado": [
    {
      "message": "Olá Leandro, excelente artigo! Te encorajo a desativar seu fb, sim, tem 01 ano que desativei o meu e continuo viva rs, sem contar que minha vida ficou infinitamente mais tranquila, durmo a noite inteira e não perco mais meu tempo com notificações babacas de pessoas que vivem naquele mundinho paralelo do fb, o \"mundinho de Alice\", onde todos são felizes, ng tem problemas e tudo está sempre bem rs... e a minha produtividade aumentou muuuito!",
      "author": "Claudia Almeida",
      "date": "2016-05-31T18:37:44"
    },
    {
      "message": "Legal! Eu tambemcoloquei uma extensao pra ocultar o feed do Facebook. A minha fica mostrando umas frases motivacionais. Hahaha.. minha produtividade melhorou muito só com isso. Bem simples, né? :D",
      "author": "Thaíssa Falbo",
      "date": "2016-01-05T17:06:27"
    },
    {
      "message": "Excelente post amigo. Vou seguir algumas de suas dicas com ctz.",
      "author": "Marcos Lourenço",
      "date": "2015-09-24T16:46:03"
    },
    {
      "message": "Destaco também perda de tempo com outros vícios: fumo, bebida, pornografia... A última, então, exponencio pois está intimamente ligado à internet.",
      "author": "Luiz Gustavo Martins",
      "date": "2015-07-11T20:24:10"
    },
    {
      "message": "Venho fazendo isso há 2 anos e minha produtividade aumentou bastante!\nChego ao final do dia e fica aquela sensação de dever cumprido!\nOlha que eu ainda fico 1 hora no Facebook e 3 horas jogando videogame.\nMas antes, eram 2 horas no facebook e 6, 7 horas no videogame.",
      "author": "Luiz Gustavo Martins",
      "date": "2015-07-11T20:14:09"
    },
    {
      "message": "Cara, uma ferramenta online que me ajudou a me livrar de muita tranqueira online foi o unroll.me\ndemorava vinte minutos por dia somente pra jogar emails fora e separar o que valia a pena, agora me toma 5 minutos pra ler o que vale a pena, hehehe",
      "author": "David Correa",
      "date": "2015-03-30T14:30:43"
    },
    {
      "message": "Boas dicas! ultimamente tenho feito muito em favor do meu tempo, uma parte das dicas do blog já venho aplicando aos meus emails e contas sociais, parabéns pelo post.",
      "author": "Marcelo Lynx",
      "date": "2015-01-29T21:11:25"
    },
    {
      "message": "Ótimas dicas hein +1",
      "author": "João Paulo Fricks",
      "date": "2015-01-21T14:36:59"
    },
    {
      "message": "Excelente artigo, sigo esse ritual há anos e tenho aumentado cada vez mais minha produtividade.",
      "author": "Arnaldo Alves",
      "date": "2015-01-20T13:22:41"
    },
    {
      "message": "Uma coisa que eu faço quando preciso usar a internet pra estudos é separar as coisas que faço em navegadores, eu só uso o Chrome pra acessar o meu Facebook e outras futilidades mas nunca uso Firefox pra isso",
      "author": "José Lopes",
      "date": "2014-11-14T18:02:11"
    },
    {
      "message": "Ainda não exclui meu facebook por esta ser a ferramenta mais rapida de comunicação com grupo da faculdade e alguns amigos que se quer respondem mensagens no whatsapp... Realmente é importante saber regrar esses minutinhos que no final do dia viram horas perdidas na frente do computador. Já tive problemas de rendimento no trabalho justamente por causa dessas notificações infinitas que parecem te pertubar justamente na hora que você mais precisa se concentrar. Ótimo artigo, parabéns.",
      "author": "Rodrigo Ianibelli",
      "date": "2014-09-10T21:58:59"
    },
    {
      "message": "Muito bom, Parabéns. Já favoritei seu blog.",
      "author": "Jammerson",
      "date": "2014-08-10T02:17:24"
    },
    {
      "message": "MODO AVIÃO do celular quando estou dormindo nunca farei! Sei que nunca acordo com celular durante a madrugada. =)",
      "author": "Davidson Fellipe",
      "date": "2014-07-21T04:08:59"
    },
    {
      "message": "Bela postagem cara. Eu me identifiquei bastante. E a parte do amigo que te liga de madrugada foi phoda hahahahahaha :D",
      "author": "Hendrew Hélio",
      "date": "2014-06-20T21:01:25"
    },
    {
      "message": "Opa @felipefialho:disqus. \n\n\nAprendi muita coisa bacana com o Facebook e fiz um networking legal também. \n\nMas ultimamente estou com dificuldades em ambos os sentidos. Senti que estou perdendo mais do que ganhando e resolvi me ausentar por um período.\n\n\nGosto muito de contribuir com os grupos e com quem está começando mas ultimamente anda bem complicado =/\n\n\nPor esse e mais alguns motivos optei por me manter extremamente focado e resolvi compartilhar o que tem funcionado comigo =)",
      "author": "Leandro Oriente",
      "date": "2014-06-20T15:46:17"
    },
    {
      "message": "Fala Leandro, curti boa parte das ideias e concordo.\n\nEspecialmente em épocas que preciso estar muito focado nas minhas tarefas, me distancio das redes sociais. Mas acredito que todas elas, inclusive o Facebook, podem contribuir de forma positiva em vários aspectos.\n\nEstou curtindo muito esses últimos posts mais abrangentes ; )",
      "author": "Felipe Fialho",
      "date": "2014-06-20T10:00:34"
    },
    {
      "message": "As pessoas se deixam viciar. Acredito que, quando caem na realidade do sentido produtivo e evolutivo de si mesmo, talvez deixe a ferramenta em desuso. Triste é ver o ser humano desumanizado pelos seus dispositivos móveis e se tornarem antissociais. Antes das sete da manhã a criatura checa seu status no Fb para espiar a vida alheia ou checar quantas curtidas aquela foto sem noção possui. Lamentável. A inclusão digital deveria nos ajudar a crescer mentalmente mas se tornou um instrumento de involução da nossa raça. E os estudos no inglês, como estão? Abraço, Leandro.",
      "author": "Enio",
      "date": "2014-06-18T12:43:21"
    },
    {
      "message": "Extensão já instalada aqui! Uma questão muito boa é essa de filtrarmos apenas o conteúdo que nos convém e quando nos convém, caso contrário, seremos sempre bombardeados de infos que muitas vezes não nos agregam... Muito bom o post!",
      "author": "Victor Kurauchi",
      "date": "2014-06-16T21:22:35"
    },
    {
      "message": "Eu acabei separando o notebook para assuntos relacionados a trabalho e o smartphone para coisas mais sociais.\n\n\nUma das razões para não abrir mão do facebook é o contato que mantenho com algumas pessoas mais distantes. Principalmente com a galera da comunidade que é espalhada pelo Brasil e pelo mundo.",
      "author": "Leandro Oriente",
      "date": "2014-06-16T21:04:45"
    },
    {
      "message": "O que me deixa com receio de me afastar do FB é perder contato com a galera do Brasil. Mas a ideia de esconder totalmente o Newsfeed, ao menos durante o trabalho, é muito boa! Vou experimentar essa extensão.\n\n\nAbraço, cara!",
      "author": "Eduardo Shiota Yasuda",
      "date": "2014-06-16T20:42:48"
    },
    {
      "message": "De águia dos andes a oráculo da montanha. Essa amizade tá me rendendo mais que ótimas interfaces gráficas :)\n\n\nMuito obrigado pela confiança, jovem. Mais um grande post!",
      "author": "Rodrigo Muniz",
      "date": "2014-06-16T20:28:55"
    }
  ],
  "nao-seja-um-mendigo-virtual": [
    {
      "message": "Certamente @Leandro Oriente. Por isso, estas pessoas (em específico) precisam atravessar uma ponte da quantidade para a qualidade. Não há conversão por quantidade, e sim, por qualidade, segmentação e planejamento. \n\nExcelente referência! Obrigado por compartilhar. =]",
      "author": "Vitor Britto",
      "date": "2014-08-25T17:31:15"
    },
    {
      "message": "Pensei em usar a Open Sans mas estou sentindo que ela está virando a nova Arial. Em tudo quanto é canto tem Open Sans.\n\nEstou para dar uma mexida no layout e vou repensar a tipografia sim =)",
      "author": "Leandro Oriente",
      "date": "2014-08-25T17:12:22"
    },
    {
      "message": "Pois é @vitorbritto:disqus , nem entrei no ponto qualidade x quantidade aqui, mas é um excelente tópico.\n\nVale lembrar que um usuário bom é aquele que está engajado com seu conteúdo e que compra a sua ideia ao ponto de trazer novos usuários com o mesmo interesse e valorizar sua comunidade.\n\nUm usuário que deu like por obrigação, é apenas um número a mais no seu contador. Provavelmente não vai trazer benefício algum para sua marca.\n\nIsso já vem sendo abordado a tempo, inclusive com pageviews. Existem vários anunciantes mais preocupados com a qualidade do usuário ativo do que simplesmente com o número total, que pode ser facilmente adulterado.\n\nSe não falha a memória, esse post aborda muito bem isso:\nhttp://papodehomem.com.br/o-que-voce-acha-que-sabe-sobre-a-web-esta-errado/",
      "author": "Leandro Oriente",
      "date": "2014-08-25T17:11:33"
    },
    {
      "message": "Uma pena ter feito a leitura deste artigo somente hoje! \n\nBom, não existe segmentação nas redes sociais. Uma extensa ponte precisa ser atravessada, da quantidade para a qualidade, a fim de atingir os resultados necessários. \n\nPor mais que haja o empenho de algumas pessoas em mostrar como agir corretamente, a maioria trilha um caminho altamente prejudicial e equivocado. Obrigar as pessoas, por qualquer meio que seja, não é sensato, útil e não dá resultados satisfatórios.\n\nParabéns pelo post, @leandrooriente:disqus! =]",
      "author": "Vitor Britto",
      "date": "2014-08-13T02:55:11"
    },
    {
      "message": "Falando em UX... Seria legal você rever a fonte que está usando em seu conteúdo. Usa uma Open Sans ou algo mais legível. Essa que vc está usando é um pouco ruim de ler. Mas o artigo foi ótimo!!\nFlw!!",
      "author": "Luciano Braga",
      "date": "2014-08-12T05:34:59"
    },
    {
      "message": "Ótimo texto :) E é bem assim que acontece mesmo, mts mendigos por ai. rsrs\n\n\nAbraços!",
      "author": "Thais Hipolito",
      "date": "2014-05-27T17:51:59"
    },
    {
      "message": "Muito bom, parabéns!",
      "author": "Flávio",
      "date": "2014-03-14T16:47:20"
    },
    {
      "message": "Bacana, pensamos da mesma forma.Mas convenhamos...Eles (os que esquecem) são maioria rsrsrs  #infelizmente\n\n Abração!",
      "author": "Danilo Rafael Nogueira",
      "date": "2014-03-08T18:01:19"
    },
    {
      "message": "Opa @danilorafaelnogueira:disqus perdão pela demora.\n\n\nCom certeza. Um dos motivos para escrever aqui é alimentar meu ego e reduzir meu tempo vago.\nEspero sim muitos compartilhamentos, bons números no analytics e vários debates nos comentários. Só não forço a barra. Tento fazer isso de forma orgânica focando 100% na experiência de leitura e no bom conteúdo.\n\n\nA crítica aqui é justamente em quem esquece desse ponto trivial.",
      "author": "Leandro Oriente",
      "date": "2014-03-07T17:23:51"
    },
    {
      "message": "É bem por ai mesmo @glauber_treml:disqus.\n\n\nComo comentei, se o seu conteúdo é bom, o usuário vai querer compartilhar. Você pode não ter uma única opção de share aparente mas ele vai dar o jeito dele e espalhar o material bacana que leu.\n\n\nVi alguns cases recentes que removeram as opções de share da interface e surpreendentemente tiveram um acréscimo de compartilhamentos. (Perdi a fonte, mas juro que li rsrs).\n\n\nQuanto a tecnologia, concordo totalmente. Canso de ver gente preparando um canhão para matar uma formiga, pelo simples fato de querer mostrar que domina aquilo. Se pretende usar armamento pesado, escolha um inimigo a altura.\n\n\nInfelizmente ainda temos essa falsa impressão de que para viver de web basta colocar um blog no ar, postar memes e entupir de ads e opções de share.",
      "author": "Leandro Oriente",
      "date": "2014-03-07T17:21:35"
    },
    {
      "message": "Poxa Leandro, não sei nem o que dizer. Sensacional seu post, fala curto, direto e reto. Ando lendo algumas coisas a este respeito, e posso te mostrar alguns pontos de vista, sobre o porque destes esmoladores da web. Primeiro, que acho que é muito raro encontrar pessoas como você, que gostam de escrever (ou parecem gostar), a maioria dos portais e colunistas deixam a informação de lado e focam apenas no que querem alcançar como resultados (o like, tantas compartilhadas, tantos seguidores a mais, visitas e etc) e isso é um erro.\n\n\nO segundo ponto é que muita gente ainda não se ligou sobre a importância do conteúdo, a web não passa de um meio editorial, por mais que exista uma identidade visual bacana, recursos super interessantes, ou até uma boa experiência, sem conteúdo meu amigo, isso tudo por incrível que pareça, passa a ser vazio. Você como desenvolvedor front-end deve saber como é, a área está cheia de gente querendo mostrar suas novas habilidades, simplesmente para mostrar que é capaz. Ai eu te digo, será que sempre precisa de tanto? Há até autores que dizem que o conteúdo na web é totalmente negligenciado, parece um ponto de vista até radical, mas não duvido viu. Parabéns pelo texto, um abraço!",
      "author": "Glauber Treml",
      "date": "2014-03-07T17:05:33"
    },
    {
      "message": "Todos somos mendigos guri.Afinal viver em sociedade (mesmo que seja virtual) requer aprovação alheia.Infelizmente, o jeito é ironizar com uma pitada de bom humor.Como fez você...Mas isso também não o tira da sociedade mendicante,pois tenho certeza que você ficaria frustrado se ninguém comentasse sua postagem.",
      "author": "Danilo Rafael Nogueira",
      "date": "2013-11-07T14:10:48"
    },
    {
      "message": "Verdade, não é \"de graça\", mas quase. Se todos os sites foram pro modelo \"assine ou não acessará mais\", como alguns portais de notícia já fizeram, vamos ter saudade de como funciona hoje.",
      "author": "Daniel Lemes",
      "date": "2013-11-02T02:21:38"
    },
    {
      "message": "\"Simplesmente fecho a janela e aprecio o conteúdo\".\n\nEntão @DanielLemes:disqus, é justamente isso. \nVc raramente vai curtir algo antes de ter verificado se o conteúdo é realmente bom.\nTer que fechar um modal antes de consumir o conteúdo é ruim para a experiência do usuário.\n\nExistem diversas formas de \"sugerir\" ao usuário que curta o seu conteúdo ou realize uma ação, desde que seja feito depois do término da leitura.\n\nA melhor hora possível para pedir que o usuário assine a newsletter, curta a página, comente ou acesse um post relacionado é no final do artigo, depois que ele está satisfeito (ou não).\n\nImagine o seguinte cenário.\n\nVocê chega numa concessionária para comprar um carro. \nSua meta naquele ambiente é comprar um carro.\n\nPara aumentar a \"conversão\" o vendedor precisa focar em te vender o carro.\nNão adianta te oferecer opcionais, garantia estendida  plano de fidelidade antes de concluir o objetivo básico dele. \n\nO mesmo vale para web, deixe seu usuário concluir objetivo básico dele sem interrupções.\n\nE outro detalhe importante. Na internet nada é \"grátis\" por mais que aparente ser.",
      "author": "Leandro Oriente",
      "date": "2013-10-31T16:47:03"
    },
    {
      "message": "Opa, muita generosidade de sua parte @felipetheossi:disqus =)\n\nVou ver se solto um post novo pra próxima semana.",
      "author": "Leandro Oriente",
      "date": "2013-10-31T16:35:01"
    },
    {
      "message": "Parabéns, texto divertido muito bem redigido além do assunto ser mega pertinente para os dias de hoje. Já ganhou meus 10% com o share, mais 40% com folow no facebook e 50% com sua página no meu feedly! Valeu",
      "author": "Felipe",
      "date": "2013-10-31T16:25:08"
    },
    {
      "message": "A caixa de \"curta o site\" não me incomoda, desde que apareça uma vez só, e que o conteúdo seja bom. Simplesmente fecho a janela e aprecio o conteúdo. Problema são as que insistem em aparecer a cada página aberta, e principalmente a que usa contagem de tempo (\"curta a página ou não vai ler nada durante 1 minuto\"). Essa segundo é o cúmulo da falta de bom senso, pois é óbvio que ninguém espera esse tempo se pode voltar aos resultados de busca e ler outro post.\n\n\nEntendo que as pessoas tem pressa, mas é preciso também ter um pouco de boa vontade, afinal conteúdo grátis com qualidade requer algumas concessões. Talvez o modelo da gratuidade tenha nos deixado um tanto mimados, e qualquer janelinha ou anúncio no canto da página já vira um empecilho.\n\n\nMas entendo seu ponto de vista de que elas pedem algo antes de oferecer. Talvez fossem melhores se configuradas para aparecer só aos leitores na segunda página, ou ao chegar no final do artigo.",
      "author": "Daniel Lemes",
      "date": "2013-10-23T21:25:14"
    },
    {
      "message": "Conteúdo é o melhor SEO que tem... Marketing boca a boca ruleia desde a época de Jesus Cristo.",
      "author": "Aécio Neto",
      "date": "2013-10-11T16:35:28"
    },
    {
      "message": "Simples, prático e concreto. Teoria parceira da práxis ! Bom conteúdo .",
      "author": "Danilo Guedes",
      "date": "2013-09-28T23:51:54"
    },
    {
      "message": "muito bom o texto e útil. Esses modais realmente são o cúmulo da \"mendiguice\" virtual. \nYou have my like ;)",
      "author": "Jully Basilio",
      "date": "2013-09-13T04:17:06"
    },
    {
      "message": "Baita texto Leandro. Entre tantas coisas que tu citou no post, a parte da modal na minha opinião é a mais \"invasiva\" de todas. Valeu por compartilhar as tuas experiências :)",
      "author": "Marcelo Matzembacher",
      "date": "2013-09-11T05:14:23"
    },
    {
      "message": "Vou guardar com carinho @868d3f7e1e7e6b68834d8475d0217087:disqus \n\n\nComeçando a escrever outro post aqui =)",
      "author": "Leandro Oriente",
      "date": "2013-08-27T20:54:48"
    },
    {
      "message": "Vlw @marcellusamadeus:disqus =)",
      "author": "Leandro Oriente",
      "date": "2013-08-27T20:54:23"
    },
    {
      "message": "Vlw @neto_neto:disqus =)",
      "author": "Leandro Oriente",
      "date": "2013-08-27T20:54:12"
    },
    {
      "message": "@1919c42a1b56b33d9241d7ad53f195e8:disqus se o Fry pediu não da pra negar né? rsrs\n\nVou passar a colocar ele no final de todos os posts.\nAliás, vou deixar padrão no layout do post =)",
      "author": "Leandro Oriente",
      "date": "2013-08-27T20:54:00"
    },
    {
      "message": "Vlw @oswaldoacauan:disqus =)",
      "author": "Leandro Oriente",
      "date": "2013-08-27T20:53:18"
    },
    {
      "message": "Toma meu like cara, rsrs, como sempre um bom conteúdo",
      "author": "Ruan Joppert",
      "date": "2013-08-27T20:46:15"
    },
    {
      "message": "Muito bom o texto, divertido e bem escrito :)",
      "author": "oswaldoacauan",
      "date": "2013-08-27T14:35:10"
    },
    {
      "message": "bom post, li inteiro mas soh vou dar like porque o fry pediu",
      "author": "Leandro",
      "date": "2013-08-26T21:59:59"
    },
    {
      "message": "Muito fera o texto. Parabéns!",
      "author": "Neto Neto",
      "date": "2013-08-26T21:53:07"
    },
    {
      "message": "Parabéns, mais um post muito útil!",
      "author": "Marcellus Amadeus",
      "date": "2013-08-26T20:24:04"
    }
  ],
  "nao-tenho-portfolio-porque-nao-tenho-clientes": [
    {
      "message": "Que post Leandro, muito bom... estou passando por isso hoje, agora tenho um norte! Difícil pra que saiu da programação desktop, como eu, e esta entrando na área de Web...",
      "author": "eric william freitas",
      "date": "2016-03-05T14:15:23"
    },
    {
      "message": "Vlw pela dica, estava precisando!",
      "author": "Fernando Guisso",
      "date": "2015-02-27T00:01:14"
    },
    {
      "message": "Cara Excelente Post, Parabéns !!!!!!",
      "author": "Mikael Lemos",
      "date": "2015-01-15T20:50:22"
    },
    {
      "message": "Excelente post! Muito bom, inspirador e animador =D",
      "author": "Delmondes Rodrigo",
      "date": "2014-09-25T12:42:42"
    },
    {
      "message": "Alguns não dão certo, outros também não dão certo... \n\nKKKKKK\n\nShow de bola",
      "author": "William Oliveira",
      "date": "2014-07-02T17:36:29"
    },
    {
      "message": "Este post é muito interessante e bastante interessante... Já falei que ele é interessante? Pois é, foi muito útil e refleti bastante sobre isto. Valeu :)",
      "author": "Matheus Souza",
      "date": "2014-06-02T03:22:39"
    },
    {
      "message": "nada mais nada menos que excelente!",
      "author": "Anderson Meira",
      "date": "2014-04-29T00:10:25"
    },
    {
      "message": "Deixar meus parabéns pra ti, me ajudou bastante!!!!",
      "author": "Douglas Ernesto",
      "date": "2014-04-02T02:18:22"
    },
    {
      "message": "Po Leandro, Show de bola o conteúdo cara parabéns! Eu ja havia pensando em algumas coisas, mas o lance de experimentos e re-design me chamou muito a atenção!",
      "author": "Ryan Felipe Moraes",
      "date": "2014-02-21T17:21:09"
    },
    {
      "message": "\"coloca em prática tudo o que aprendeu mas na hora de trocar as imagens de placeholder pelos seus trabalhos... Nada.\"\nAHhahahahahaha exato!",
      "author": "Vinícius Wachekowski Palma",
      "date": "2014-01-28T13:27:03"
    },
    {
      "message": "valeu pela dica parceiro",
      "author": "Osvijamys Oz",
      "date": "2014-01-25T04:34:44"
    },
    {
      "message": "Muito bom cara, curto muito seus posts, sempre entro aqui e revejo o \"como me tornar um desenvolvedor Front-End\"",
      "author": "fabio",
      "date": "2014-01-25T03:17:47"
    },
    {
      "message": "Gostei do post Leandro, parabéns!! \nEngraçado que hoje, escutei os caras do Podcast FalaFreela falar quase a mesma coisa em relação ao portfólio.",
      "author": "Diego Soares",
      "date": "2014-01-21T16:44:08"
    },
    {
      "message": "O exemplo do \"site que postaram no grupo e virou motivo de chacota\" mostra como é importante ter um ponto de vista positivo sobre as coisas sempre. Enquanto uns apenas olham e pensam: \"Que site horrível\", outros enxergam nisso uma oportunidade para construir um portfólio e se destacar profissionalmente. Muito bom o post, parabéns.",
      "author": "Henrique Silvério",
      "date": "2014-01-21T15:40:21"
    },
    {
      "message": "Vale muito a pena cara. Tanto para freelas, quanto para se candidatar a vagas em empresas maiores.\n\nÉ um diferencial absurdo. Boa parte das vezes até maior do que aquele site clichê institucional para um cliente de fato.",
      "author": "Leandro Oriente",
      "date": "2014-01-21T14:50:35"
    },
    {
      "message": "Ei Leandro, confesso que já havia pensado nisso, mas seu post foi a gota d'agua pra eu realmente e colocar em prática. Valeuzão.",
      "author": "Matheus Kramer",
      "date": "2014-01-21T14:40:49"
    },
    {
      "message": "Gostei...Parabéns man!",
      "author": "Thalles Santos",
      "date": "2014-01-21T03:52:01"
    },
    {
      "message": "Ótimas dicas mesmo cara... Você está ajudando muito, parabéns de verdade! Continue firme gerando conteúdo pra gente :D",
      "author": "Eric Douglas",
      "date": "2014-01-20T17:08:54"
    },
    {
      "message": "Sempre provocante e motivador seus posts! Parabéns! ",
      "author": "Gabriel Mendes",
      "date": "2014-01-20T17:03:48"
    }
  ],
  "novo-portfolio": [
    {
      "message": "Olá!\nComecei a fazer a tradução do site e da documentação do Jekyll para o português, http://jekyllrb.com.br/\nSe alguém quiser colaborar, segue o endereço do repositório https://github.com/matheusme/jekyllrb.com.br\nContamos com vocês!",
      "author": "matheus",
      "date": "2013-10-09T17:26:55"
    },
    {
      "message": "Assim como você, resolvi criar um blog e tirar a cara de portfólio, sempre gostei de escrever mas o que me faltava era tempo, agora tenho que arrumar de qualquer forma pra escrever rsrs\nNem optei pelo wp, pra por logo no ar e com o tempo melhorar, optei pelo Tumblr, pode ser bem bestinha, mas consegui adapta-lo ao que utilizo no momento e está me gerando um resultado legal..\nTenho muita curiosidade no Jekyll, vi uma palestra a uns meses atrás que me deixaram fascinados por essa ferramenta, em breve evoluo o meu pra Jekyll :P\n\n\nParabéns pelo trabalho no blog, e continue assim ;)",
      "author": "Thulio Philipe",
      "date": "2013-09-28T00:19:38"
    },
    {
      "message": "Irado @disqus_1J7bucmpTG:disqus \n\n\nÉ bem semelhante ao Jekyll pelo que pude notar.\nSinceramente me senti mais a vontade com o blog assim escrevendo posts em markdown (no caso do BR-Linux é algo como o utilizado em fóruns né?) do que no Admin do Wordpress.\n\n\nAlém disso, o fato de gerar estáticos sem ter que se preocupar com uma camada de cache é perfeito.\nA entrega é realmente muito rápida.\n\n\nFiz uns ajustes básicos de infra e no desenvolvimento do blog e consegui 93 no YSlow.\n\n\nVou dar uma olhada no SPDY. \nE foi mal a demora. Operei a vista esses dias e fiquei um pouco ausente.",
      "author": "Leandro Oriente",
      "date": "2013-09-13T16:40:20"
    },
    {
      "message": "Bacana Leandro. Alguns sites bem acessados que estão utilizando a mesma tática pra gerenciar seus conteudos. Um exemplo é o BR-Linux http://br-linux.org/2013/01/br-linux-troca-wordpress-pelo-axe.html\n\nSobre o NGINX se vc se interessar por infra, dê uma olhada no módulo SPDY.",
      "author": "decko",
      "date": "2013-09-11T01:56:50"
    },
    {
      "message": "Legal, já vi falar muito do Jekyll e na real está crescendo bastante.\n\nTá na hr de rola uma artiguinho né, abraços...",
      "author": "Anderson Menezes",
      "date": "2013-08-29T18:35:04"
    },
    {
      "message": "Acho que Jekyll se restringe bastante a blogs de desenvolvedores.\nPara quem tem certo conhecimento e não pretende ter centenas ou milhares de posts é uma ferramenta bem enxuta e executa bem o que se propõe a fazer, porém não recomendo que use num portal de conteúdo com maiores pretensões.\n\nNesse caso não nadaria contra a maré e investiria no Wordpress mesmo.\nO Admin dele é muito simples de ser usado. Qualquer leigo em TI pode ser facilmente um editor/autor e ele oferece ferramentas que tornam a gestão do conteúdo mais simples.\n\nSeguem alguns exemplos de gigantes de TI que utilizam o wordpress como CMS.\n- http://www.smashingmagazine.com/\n- http://net.tutsplus.com/\n\nE o Abduzeedo do brasileiro Fábio Sasso usa Drupal que também é constantemente recomendado apesar de nunca ter utilizado.\n- http://abduzeedo.com/",
      "author": "Leandro Oriente",
      "date": "2013-08-22T02:50:28"
    },
    {
      "message": "Cara tenho uma dúvida, ao seu ponto de vista o Jekyll é recomendado para um portal?\n\nE quais outras tecnologias você recomenda que faça os includes em html?\n\nAbraço e parabéns pelo site.",
      "author": "Fred",
      "date": "2013-08-22T02:41:18"
    },
    {
      "message": "Muito bom Leandro, vejo varias pessoas mudando pro JEKYLL , ele está separado aqui para estudos futuros  rsrs muito bacana seu novo portfólio parabéns !",
      "author": "João Pedro Nascimento",
      "date": "2013-08-19T18:25:01"
    }
  ],
  "o-que-e-black-friday-e-porque-nao-funciona-no-brasil": [
    {
      "message": "Li o artigo agora, em 2014. Muito bom. Vale acrescentar o seguinte: em promoçāo de vendas a lógica do fácil e rápido é fundamental. Porém uma serie de \"comentaristas\" ficam alertando a galera sobre \"como nāo ser enganado na black friday\". Só falta sugerir que se cheque o \"serasa\" do vendedor, ou seja, matam totalmente a lógica de promoçāo de vendas. Nos EUA um economista observou que todos os preços praticados no black friday, em algum momento durante o ano, também serāo praticados pela mesma empresa. Entāo nāo vale a Energia física e emocional que o comprador dispense no BF. É melhor acionar alertas das lojas que, em aalgum momento durante o ano, vc terá uma oferta de preço igual a do black. Friday.",
      "author": "Marino Petrillo Neto",
      "date": "2014-11-29T16:01:49"
    },
    {
      "message": "Será que foi por esse motivo que um refrigerador que custava 3.400,00 á dois dias no WALMART, hoje está por 3,821,00??\n\nEstamos fazendo papel de palhaço mesmo  =(",
      "author": "Zane",
      "date": "2014-10-29T01:10:29"
    },
    {
      "message": "acho que ainda tem muito pra evoluir",
      "author": "jesus",
      "date": "2014-02-27T01:26:34"
    },
    {
      "message": "Excelente o artigo Leandro.\nEu particularmente acho que no Brasil ocorre a mesma coisa, mas em épocas diferentes. Note que aqui as liquidações acontecem mesmo após o Natal, no mês de janeiro. Li recentemente em alguns portais alguns especialistas recomendando você deixar para fazer as compras de Natal em janeiro pois os descontos podem chegar até 80%.",
      "author": "Newton Dantas",
      "date": "2013-12-04T20:01:57"
    },
    {
      "message": "Pensei o mesmo sobre o Node.",
      "author": "Felipe Fialho",
      "date": "2013-12-04T10:42:45"
    },
    {
      "message": "Explicação super bacana Leandro.",
      "author": "Felipe Fialho",
      "date": "2013-12-04T10:42:23"
    },
    {
      "message": "Poderia também rolar um artigo sobre a questão de performance das lojas. Afinal, muitas cairam aos prantos. E eu sinto cheio de node crescendo no Brasil.",
      "author": "Mateus Avila Isidoro",
      "date": "2013-12-04T01:00:47"
    },
    {
      "message": "Também vi relatos sobre isso, de algumas lojas permitirem compras só através de Cartão de Crédito.\nOs dois pedidos que fiz neste BlackFriday foram via Boleto Bancário, na Americanas e FastShop, em ambas o procedimento foi normal, agora aguardo a chegada =)",
      "author": "Thiago Nascimento Oliveira",
      "date": "2013-12-04T00:57:39"
    },
    {
      "message": "Interessante, myth busted!",
      "author": "brenocalazans",
      "date": "2013-12-04T00:51:02"
    },
    {
      "message": "Cara, achei isso também, mas tentei fazer algumas compras com boleto e em todas tive sucesso.\nAlguns no entanto não estavam com o desconto.",
      "author": "Leandro Oriente",
      "date": "2013-12-04T00:34:43"
    },
    {
      "message": "Acredito que durante a Black Friday muitas lojas não aceitem pagamento em Boleto por que o produto tem que ser reservado por alguns dias para dar tempo do cliente ir poder pagar o boleto. Com isso, o produto fica num limbo na espera de um pagamento incerto, que pode ou não pode ser feito. Com cartão de crédito ou outros meios, a loja tem a venda (e principalmente o dinheiro) garantida.",
      "author": "brenocalazans",
      "date": "2013-12-04T00:27:19"
    },
    {
      "message": "É que não fazem algo unificado.\n\nCada loja escolhe uma data para dar a louca no patrão.\nQuem fica monitorando com frequência acaba pegando um ou outro, mas geralmente acaba antes que os pobres mortais comprem algo bom.",
      "author": "Leandro Oriente",
      "date": "2013-12-03T23:30:52"
    },
    {
      "message": "Podia ter citado que a época no Brasil onde rolam descontos mais ou menos bons é nas liquidações de início do ano, época que as lojas querem se livrar do estoque fora de normal do Natal.\n\nNão é assim uma black friday, mas dá pra achar alguns bons preços ;)",
      "author": "Leonardo Alberto Souza",
      "date": "2013-12-03T23:23:59"
    },
    {
      "message": "Opa com certeza. \nConsegui um sensor de ré e 7 jogos na Steam e na Origin por R$ 50,00.\n\nDa para aproveitar, mas tem que ficar de olho pra não cair em cilada.\n\nApesar de não ser uma queima de estoque real é bom aproveitar um descontinho.",
      "author": "Leandro Oriente",
      "date": "2013-12-03T23:17:50"
    },
    {
      "message": "Ótimo artigo Leandro!\n\nA Black Friday no Brasil é apenas (mais) um dia de promoção (normal?), não uma limpeza, um queimão um dia com preços absurdamente \"mágicos\" como se acontece nos EUA. Mas como disse, dá sim pra aproveitar e bem os descontos, basta acompanhar com (boa) antecedência os preços e ter muita paciência na hora de comprar!\n\nÉ a segunda vez que me empenho - suo a camisa - e faço boas compras, conseguindo produtos com até 50% de desconto do valor real. Não é uma Black Friday americana, mas dá para aproveitar! ;)",
      "author": "Thiago Nascimento Oliveira",
      "date": "2013-12-03T23:15:50"
    }
  ],
  "ola-mundo": [
    {
      "message": "Opa @Haple.\n\n\nObrigado por comentar. \n\n\nEntendo bem o que sente e recomendo que continue acompanhando o blog. Não é extremamente técnico, mas vez ou outra solto alguma coisa ou uma referência. Por outro lado exponho bastante minha experiências e o que funcionou ou não para mim.\n\n\nAbs",
      "author": "Leandro Oriente",
      "date": "2014-06-16T00:25:35"
    },
    {
      "message": "Cara, eu não sou muito de comentar em blogs, comunidades (tal, tal, tal), porém gostei muito dos posts que eu li no seu site, e isso me fez querer comentar(e claro, ler) cada post!\nAgora falando um pouco sobre mim(algo desnecessário). Sou um jovem com uma vontade tremenda de criar diversas coisas na área de informática como programas realmente úteis, sites interativos, enfim. Nunca tive muita vontade muita vontade de expor a minha opinião pois achava desnecessário, porém agora vejo como é importante tanto para o autor do conteúdo lido, tanto para mim. Bem... Antes de mais nada, já lhe peço desculpas por comentários  sem sentido ou desnecessários.\nUm abraço, e até futuros posts!",
      "author": "Haple",
      "date": "2014-06-15T01:44:43"
    }
  ],
  "seu-cliente-precisa-de-um-site": [
    {
      "message": "Nada @eliaspaiva:disqus.\nRecomendo a leitura do livro \"Lean Startup\" ou \"A Startup Enxuta\" em português.\n\nVai te ajudar muito nessa nova empreitada =)",
      "author": "Leandro Oriente",
      "date": "2014-01-14T17:54:05"
    },
    {
      "message": "Cara, simplesmente fantástico. Ótimo texto. Estou pensando em abrir uma empresa em alguns anos e você acabou de me fazer economizar futuros 2 mil reais. haha!",
      "author": "Elias Paiva",
      "date": "2014-01-14T17:47:27"
    }
  ],
  "we-want-you-vtex-contrata": [
    {
      "message": "Que coisa hein! Eu atendo esses requisitos! Pena que estou em Juquitiba - SP!!!",
      "author": "Pedro Neto",
      "date": "2015-02-21T12:54:17"
    },
    {
      "message": "Vou mandar sim !",
      "author": "Fabiano Lacerda",
      "date": "2013-08-25T23:16:20"
    },
    {
      "message": "@fabianolacerda:disqus bem bacana o admin. \nEstamos precisando de alguem com boa lógica de programação e uma base legal em Javascript.\n\nManda um email pro Guilherme/Gabriel.",
      "author": "Leandro Oriente",
      "date": "2013-08-25T22:39:25"
    },
    {
      "message": "Estão em aberto sim. Caso fechem vou atualizar o post.",
      "author": "Leandro Oriente",
      "date": "2013-08-25T22:37:11"
    },
    {
      "message": "Olá, leandro!\nAs vagas continuam em aberto?\nAtendo aos pré-requisitos que você citou para front.\n\nInclusive já estagiei em uma outra empresa de Web.\nE adoraria aprender coisas novas, ainda mais voltadas para e-commerce.\n\nAh, outra coisa, é necessário ter nível superior?\nNo caso, estou terminando meu curso técnico agora.\nAinda nem entrei na faculdade, mas já tenho alguma experiência...\nE muita vontade!\n\nAbraço!",
      "author": "Breno Alves",
      "date": "2013-08-25T17:11:13"
    },
    {
      "message": "Olá Leandro! Sou desenvolvedor autodidata em Frontend e Backend, já desenvolvi uma plataforma de e-commerce e atualmente estou desenvolvendo um sistema de Gestão de finanças pessoais. Tenho conhecimento amplo em Html, CSS, Jquery e programação PHP. O sistema de gestão de finanças encontra-se no seguinte link: http://www.linhaintima.com.br/relatorios/entradas-saidas (Ainda está sendo estilizado, portanto existem paginas que ainda estão sendo desenvolvidas)\n\nGrande Abraço!",
      "author": "Fabiano Lacerda",
      "date": "2013-08-21T12:54:07"
    },
    {
      "message": "Interessado...",
      "author": "Alison Gabiatti",
      "date": "2013-08-21T01:32:16"
    },
    {
      "message": "não possuo todos os pre-requisitos\n\ntenho conhecimento intermediário em html e css mas pouquíssimo nos demais. a pouco mais de 6 meses venho a estudar essas áreas \n\napesar de ter aptidão intuitiva (autodidata) , existem outras pessoas mais qualificadas do que eu nesse momento.",
      "author": "lucas coutinho silva",
      "date": "2013-08-21T01:18:49"
    },
    {
      "message": "@disqus_imDfn7x8qA:disqus pra vaga de estágio seria bom conhecimentos regulares em Javascript e algoritmos e uma base sólida de HTML e CSS.\n\nSe tiver conhecimentos em Git, Twitter Bootstrap, Angular e souber lidar com terminal seria um diferencial e tanto.",
      "author": "Leandro Oriente",
      "date": "2013-08-20T19:19:32"
    },
    {
      "message": "quais os requisitos ??",
      "author": "lucas coutinho",
      "date": "2013-08-20T18:30:45"
    }
  ]
}